<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<meta name="generator" content="Asciidoctor 2.0.26">
<title>Curso de Bases de Datos Vectoriales y de Grafos</title>
<link rel="stylesheet" href="https://fonts.googleapis.com/css?family=Open+Sans:300,300italic,400,400italic,600,600italic%7CNoto+Serif:400,400italic,700,700italic%7CDroid+Sans+Mono:400,700">
<style>
/*! Asciidoctor default stylesheet | MIT License | https://asciidoctor.org */
/* Uncomment the following line when using as a custom stylesheet */
/* @import "https://fonts.googleapis.com/css?family=Open+Sans:300,300italic,400,400italic,600,600italic%7CNoto+Serif:400,400italic,700,700italic%7CDroid+Sans+Mono:400,700"; */
html{font-family:sans-serif;-webkit-text-size-adjust:100%}
a{background:none}
a:focus{outline:thin dotted}
a:active,a:hover{outline:0}
h1{font-size:2em;margin:.67em 0}
b,strong{font-weight:bold}
abbr{font-size:.9em}
abbr[title]{cursor:help;border-bottom:1px dotted #dddddf;text-decoration:none}
dfn{font-style:italic}
hr{height:0}
mark{background:#ff0;color:#000}
code,kbd,pre,samp{font-family:monospace;font-size:1em}
pre{white-space:pre-wrap}
q{quotes:"\201C" "\201D" "\2018" "\2019"}
small{font-size:80%}
sub,sup{font-size:75%;line-height:0;position:relative;vertical-align:baseline}
sup{top:-.5em}
sub{bottom:-.25em}
img{border:0}
svg:not(:root){overflow:hidden}
figure{margin:0}
audio,video{display:inline-block}
audio:not([controls]){display:none;height:0}
fieldset{border:1px solid silver;margin:0 2px;padding:.35em .625em .75em}
legend{border:0;padding:0}
button,input,select,textarea{font-family:inherit;font-size:100%;margin:0}
button,input{line-height:normal}
button,select{text-transform:none}
button,html input[type=button],input[type=reset],input[type=submit]{-webkit-appearance:button;cursor:pointer}
button[disabled],html input[disabled]{cursor:default}
input[type=checkbox],input[type=radio]{padding:0}
button::-moz-focus-inner,input::-moz-focus-inner{border:0;padding:0}
textarea{overflow:auto;vertical-align:top}
table{border-collapse:collapse;border-spacing:0}
*,::before,::after{box-sizing:border-box}
html,body{font-size:100%}
body{background:#fff;color:rgba(0,0,0,.8);padding:0;margin:0;font-family:"Noto Serif","DejaVu Serif",serif;line-height:1;position:relative;cursor:auto;-moz-tab-size:4;-o-tab-size:4;tab-size:4;word-wrap:anywhere;-moz-osx-font-smoothing:grayscale;-webkit-font-smoothing:antialiased}
a:hover{cursor:pointer}
img,object,embed{max-width:100%;height:auto}
object,embed{height:100%}
img{-ms-interpolation-mode:bicubic}
.left{float:left!important}
.right{float:right!important}
.text-left{text-align:left!important}
.text-right{text-align:right!important}
.text-center{text-align:center!important}
.text-justify{text-align:justify!important}
.hide{display:none}
img,object,svg{display:inline-block;vertical-align:middle}
textarea{height:auto;min-height:50px}
select{width:100%}
.subheader,.admonitionblock td.content>.title,.audioblock>.title,.exampleblock>.title,.imageblock>.title,.listingblock>.title,.literalblock>.title,.stemblock>.title,.openblock>.title,.paragraph>.title,.quoteblock>.title,table.tableblock>.title,.verseblock>.title,.videoblock>.title,.dlist>.title,.olist>.title,.ulist>.title,.qlist>.title,.hdlist>.title{line-height:1.45;color:#7a2518;font-weight:400;margin-top:0;margin-bottom:.25em}
div,dl,dt,dd,ul,ol,li,h1,h2,h3,#toctitle,.sidebarblock>.content>.title,h4,h5,h6,pre,form,p,blockquote,th,td{margin:0;padding:0}
a{color:#2156a5;text-decoration:underline;line-height:inherit}
a:hover,a:focus{color:#1d4b8f}
a img{border:0}
p{line-height:1.6;margin-bottom:1.25em;text-rendering:optimizeLegibility}
p aside{font-size:.875em;line-height:1.35;font-style:italic}
h1,h2,h3,#toctitle,.sidebarblock>.content>.title,h4,h5,h6{font-family:"Open Sans","DejaVu Sans",sans-serif;font-weight:300;font-style:normal;color:#ba3925;text-rendering:optimizeLegibility;margin-top:1em;margin-bottom:.5em;line-height:1.0125em}
h1 small,h2 small,h3 small,#toctitle small,.sidebarblock>.content>.title small,h4 small,h5 small,h6 small{font-size:60%;color:#e99b8f;line-height:0}
h1{font-size:2.125em}
h2{font-size:1.6875em}
h3,#toctitle,.sidebarblock>.content>.title{font-size:1.375em}
h4,h5{font-size:1.125em}
h6{font-size:1em}
hr{border:solid #dddddf;border-width:1px 0 0;clear:both;margin:1.25em 0 1.1875em}
em,i{font-style:italic;line-height:inherit}
strong,b{font-weight:bold;line-height:inherit}
small{font-size:60%;line-height:inherit}
code{font-family:"Droid Sans Mono","DejaVu Sans Mono",monospace;font-weight:400;color:rgba(0,0,0,.9)}
ul,ol,dl{line-height:1.6;margin-bottom:1.25em;list-style-position:outside;font-family:inherit}
ul,ol{margin-left:1.5em}
ul li ul,ul li ol{margin-left:1.25em;margin-bottom:0}
ul.circle{list-style-type:circle}
ul.disc{list-style-type:disc}
ul.square{list-style-type:square}
ul.circle ul:not([class]),ul.disc ul:not([class]),ul.square ul:not([class]){list-style:inherit}
ol li ul,ol li ol{margin-left:1.25em;margin-bottom:0}
dl dt{margin-bottom:.3125em;font-weight:bold}
dl dd{margin-bottom:1.25em}
blockquote{margin:0 0 1.25em;padding:.5625em 1.25em 0 1.1875em;border-left:1px solid #ddd}
blockquote,blockquote p{line-height:1.6;color:rgba(0,0,0,.85)}
@media screen and (min-width:768px){h1,h2,h3,#toctitle,.sidebarblock>.content>.title,h4,h5,h6{line-height:1.2}
h1{font-size:2.75em}
h2{font-size:2.3125em}
h3,#toctitle,.sidebarblock>.content>.title{font-size:1.6875em}
h4{font-size:1.4375em}}
table{background:#fff;margin-bottom:1.25em;border:1px solid #dedede;word-wrap:normal}
table thead,table tfoot{background:#f7f8f7}
table thead tr th,table thead tr td,table tfoot tr th,table tfoot tr td{padding:.5em .625em .625em;font-size:inherit;color:rgba(0,0,0,.8);text-align:left}
table tr th,table tr td{padding:.5625em .625em;font-size:inherit;color:rgba(0,0,0,.8)}
table tr.even,table tr.alt{background:#f8f8f7}
table thead tr th,table tfoot tr th,table tbody tr td,table tr td,table tfoot tr td{line-height:1.6}
h1,h2,h3,#toctitle,.sidebarblock>.content>.title,h4,h5,h6{line-height:1.2;word-spacing:-.05em}
h1 strong,h2 strong,h3 strong,#toctitle strong,.sidebarblock>.content>.title strong,h4 strong,h5 strong,h6 strong{font-weight:400}
.center{margin-left:auto;margin-right:auto}
.stretch{width:100%}
.clearfix::before,.clearfix::after,.float-group::before,.float-group::after{content:" ";display:table}
.clearfix::after,.float-group::after{clear:both}
:not(pre).nobreak{word-wrap:normal}
:not(pre).nowrap{white-space:nowrap}
:not(pre).pre-wrap{white-space:pre-wrap}
:not(pre):not([class^=L])>code{font-size:.9375em;font-style:normal!important;letter-spacing:0;padding:.1em .5ex;word-spacing:-.15em;background:#f7f7f8;border-radius:4px;line-height:1.45;text-rendering:optimizeSpeed}
pre{color:rgba(0,0,0,.9);font-family:"Droid Sans Mono","DejaVu Sans Mono",monospace;line-height:1.45;text-rendering:optimizeSpeed}
pre code,pre pre{color:inherit;font-size:inherit;line-height:inherit}
pre.nowrap,pre.nowrap pre{white-space:pre;word-wrap:normal}
em em{font-style:normal}
strong strong{font-weight:400}
.keyseq{color:rgba(51,51,51,.8)}
kbd{font-family:"Droid Sans Mono","DejaVu Sans Mono",monospace;display:inline-block;color:rgba(0,0,0,.8);font-size:.65em;line-height:1.45;background:#f7f7f7;border:1px solid #ccc;border-radius:3px;box-shadow:0 1px 0 rgba(0,0,0,.2),inset 0 0 0 .1em #fff;margin:0 .15em;padding:.2em .5em;vertical-align:middle;position:relative;top:-.1em;white-space:nowrap}
.keyseq kbd:first-child{margin-left:0}
.keyseq kbd:last-child{margin-right:0}
.menuseq,.menuref{color:#000}
.menuseq b:not(.caret),.menuref{font-weight:inherit}
.menuseq{word-spacing:-.02em}
.menuseq b.caret{font-size:1.25em;line-height:.8}
.menuseq i.caret{font-weight:bold;text-align:center;width:.45em}
b.button::before,b.button::after{position:relative;top:-1px;font-weight:400}
b.button::before{content:"[";padding:0 3px 0 2px}
b.button::after{content:"]";padding:0 2px 0 3px}
p a>code:hover{color:rgba(0,0,0,.9)}
#header,#content,#footnotes,#footer{width:100%;margin:0 auto;max-width:62.5em;*zoom:1;position:relative;padding-left:.9375em;padding-right:.9375em}
#header::before,#header::after,#content::before,#content::after,#footnotes::before,#footnotes::after,#footer::before,#footer::after{content:" ";display:table}
#header::after,#content::after,#footnotes::after,#footer::after{clear:both}
#content{margin-top:1.25em}
#content::before{content:none}
#header>h1:first-child{color:rgba(0,0,0,.85);margin-top:2.25rem;margin-bottom:0}
#header>h1:first-child+#toc{margin-top:8px;border-top:1px solid #dddddf}
#header>h1:only-child{border-bottom:1px solid #dddddf;padding-bottom:8px}
#header .details{border-bottom:1px solid #dddddf;line-height:1.45;padding-top:.25em;padding-bottom:.25em;padding-left:.25em;color:rgba(0,0,0,.6);display:flex;flex-flow:row wrap}
#header .details span:first-child{margin-left:-.125em}
#header .details span.email a{color:rgba(0,0,0,.85)}
#header .details br{display:none}
#header .details br+span::before{content:"\00a0\2013\00a0"}
#header .details br+span.author::before{content:"\00a0\22c5\00a0";color:rgba(0,0,0,.85)}
#header .details br+span#revremark::before{content:"\00a0|\00a0"}
#header #revnumber{text-transform:capitalize}
#header #revnumber::after{content:"\00a0"}
#content>h1:first-child:not([class]){color:rgba(0,0,0,.85);border-bottom:1px solid #dddddf;padding-bottom:8px;margin-top:0;padding-top:1rem;margin-bottom:1.25rem}
#toc{border-bottom:1px solid #e7e7e9;padding-bottom:.5em}
#toc>ul{margin-left:.125em}
#toc ul.sectlevel0>li>a{font-style:italic}
#toc ul.sectlevel0 ul.sectlevel1{margin:.5em 0}
#toc ul{font-family:"Open Sans","DejaVu Sans",sans-serif;list-style-type:none}
#toc li{line-height:1.3334;margin-top:.3334em}
#toc a{text-decoration:none}
#toc a:active{text-decoration:underline}
#toctitle{color:#7a2518;font-size:1.2em}
@media screen and (min-width:768px){#toctitle{font-size:1.375em}
body.toc2{padding-left:15em;padding-right:0}
body.toc2 #header>h1:nth-last-child(2){border-bottom:1px solid #dddddf;padding-bottom:8px}
#toc.toc2{margin-top:0!important;background:#f8f8f7;position:fixed;width:15em;left:0;top:0;border-right:1px solid #e7e7e9;border-top-width:0!important;border-bottom-width:0!important;z-index:1000;padding:1.25em 1em;height:100%;overflow:auto}
#toc.toc2 #toctitle{margin-top:0;margin-bottom:.8rem;font-size:1.2em}
#toc.toc2>ul{font-size:.9em;margin-bottom:0}
#toc.toc2 ul ul{margin-left:0;padding-left:1em}
#toc.toc2 ul.sectlevel0 ul.sectlevel1{padding-left:0;margin-top:.5em;margin-bottom:.5em}
body.toc2.toc-right{padding-left:0;padding-right:15em}
body.toc2.toc-right #toc.toc2{border-right-width:0;border-left:1px solid #e7e7e9;left:auto;right:0}}
@media screen and (min-width:1280px){body.toc2{padding-left:20em;padding-right:0}
#toc.toc2{width:20em}
#toc.toc2 #toctitle{font-size:1.375em}
#toc.toc2>ul{font-size:.95em}
#toc.toc2 ul ul{padding-left:1.25em}
body.toc2.toc-right{padding-left:0;padding-right:20em}}
#content #toc{border:1px solid #e0e0dc;margin-bottom:1.25em;padding:1.25em;background:#f8f8f7;border-radius:4px}
#content #toc>:first-child{margin-top:0}
#content #toc>:last-child{margin-bottom:0}
#footer{max-width:none;background:rgba(0,0,0,.8);padding:1.25em}
#footer-text{color:hsla(0,0%,100%,.8);line-height:1.44}
#content{margin-bottom:.625em}
.sect1{padding-bottom:.625em}
@media screen and (min-width:768px){#content{margin-bottom:1.25em}
.sect1{padding-bottom:1.25em}}
.sect1:last-child{padding-bottom:0}
.sect1+.sect1{border-top:1px solid #e7e7e9}
#content h1>a.anchor,h2>a.anchor,h3>a.anchor,#toctitle>a.anchor,.sidebarblock>.content>.title>a.anchor,h4>a.anchor,h5>a.anchor,h6>a.anchor{position:absolute;z-index:1001;width:1.5ex;margin-left:-1.5ex;display:block;text-decoration:none!important;visibility:hidden;text-align:center;font-weight:400}
#content h1>a.anchor::before,h2>a.anchor::before,h3>a.anchor::before,#toctitle>a.anchor::before,.sidebarblock>.content>.title>a.anchor::before,h4>a.anchor::before,h5>a.anchor::before,h6>a.anchor::before{content:"\00A7";font-size:.85em;display:block;padding-top:.1em}
#content h1:hover>a.anchor,#content h1>a.anchor:hover,h2:hover>a.anchor,h2>a.anchor:hover,h3:hover>a.anchor,#toctitle:hover>a.anchor,.sidebarblock>.content>.title:hover>a.anchor,h3>a.anchor:hover,#toctitle>a.anchor:hover,.sidebarblock>.content>.title>a.anchor:hover,h4:hover>a.anchor,h4>a.anchor:hover,h5:hover>a.anchor,h5>a.anchor:hover,h6:hover>a.anchor,h6>a.anchor:hover{visibility:visible}
#content h1>a.link,h2>a.link,h3>a.link,#toctitle>a.link,.sidebarblock>.content>.title>a.link,h4>a.link,h5>a.link,h6>a.link{color:#ba3925;text-decoration:none}
#content h1>a.link:hover,h2>a.link:hover,h3>a.link:hover,#toctitle>a.link:hover,.sidebarblock>.content>.title>a.link:hover,h4>a.link:hover,h5>a.link:hover,h6>a.link:hover{color:#a53221}
details,.audioblock,.imageblock,.literalblock,.listingblock,.stemblock,.videoblock{margin-bottom:1.25em}
details{margin-left:1.25rem}
details>summary{cursor:pointer;display:block;position:relative;line-height:1.6;margin-bottom:.625rem;outline:none;-webkit-tap-highlight-color:transparent}
details>summary::-webkit-details-marker{display:none}
details>summary::before{content:"";border:solid transparent;border-left:solid;border-width:.3em 0 .3em .5em;position:absolute;top:.5em;left:-1.25rem;transform:translateX(15%)}
details[open]>summary::before{border:solid transparent;border-top:solid;border-width:.5em .3em 0;transform:translateY(15%)}
details>summary::after{content:"";width:1.25rem;height:1em;position:absolute;top:.3em;left:-1.25rem}
.admonitionblock td.content>.title,.audioblock>.title,.exampleblock>.title,.imageblock>.title,.listingblock>.title,.literalblock>.title,.stemblock>.title,.openblock>.title,.paragraph>.title,.quoteblock>.title,table.tableblock>.title,.verseblock>.title,.videoblock>.title,.dlist>.title,.olist>.title,.ulist>.title,.qlist>.title,.hdlist>.title{text-rendering:optimizeLegibility;text-align:left;font-family:"Noto Serif","DejaVu Serif",serif;font-size:1rem;font-style:italic}
table.tableblock.fit-content>caption.title{white-space:nowrap;width:0}
.paragraph.lead>p,#preamble>.sectionbody>[class=paragraph]:first-of-type p{font-size:1.21875em;line-height:1.6;color:rgba(0,0,0,.85)}
.admonitionblock>table{border-collapse:separate;border:0;background:none;width:100%}
.admonitionblock>table td.icon{text-align:center;width:80px}
.admonitionblock>table td.icon img{max-width:none}
.admonitionblock>table td.icon .title{font-weight:bold;font-family:"Open Sans","DejaVu Sans",sans-serif;text-transform:uppercase}
.admonitionblock>table td.content{padding-left:1.125em;padding-right:1.25em;border-left:1px solid #dddddf;color:rgba(0,0,0,.6);word-wrap:anywhere}
.admonitionblock>table td.content>:last-child>:last-child{margin-bottom:0}
.exampleblock>.content{border:1px solid #e6e6e6;margin-bottom:1.25em;padding:1.25em;background:#fff;border-radius:4px}
.sidebarblock{border:1px solid #dbdbd6;margin-bottom:1.25em;padding:1.25em;background:#f3f3f2;border-radius:4px}
.sidebarblock>.content>.title{color:#7a2518;margin-top:0;text-align:center}
.exampleblock>.content>:first-child,.sidebarblock>.content>:first-child{margin-top:0}
.exampleblock>.content>:last-child,.exampleblock>.content>:last-child>:last-child,.exampleblock>.content .olist>ol>li:last-child>:last-child,.exampleblock>.content .ulist>ul>li:last-child>:last-child,.exampleblock>.content .qlist>ol>li:last-child>:last-child,.sidebarblock>.content>:last-child,.sidebarblock>.content>:last-child>:last-child,.sidebarblock>.content .olist>ol>li:last-child>:last-child,.sidebarblock>.content .ulist>ul>li:last-child>:last-child,.sidebarblock>.content .qlist>ol>li:last-child>:last-child{margin-bottom:0}
.literalblock pre,.listingblock>.content>pre{border-radius:4px;overflow-x:auto;padding:1em;font-size:.8125em}
@media screen and (min-width:768px){.literalblock pre,.listingblock>.content>pre{font-size:.90625em}}
@media screen and (min-width:1280px){.literalblock pre,.listingblock>.content>pre{font-size:1em}}
.literalblock pre,.listingblock>.content>pre:not(.highlight),.listingblock>.content>pre[class=highlight],.listingblock>.content>pre[class^="highlight "]{background:#f7f7f8}
.literalblock.output pre{color:#f7f7f8;background:rgba(0,0,0,.9)}
.listingblock>.content{position:relative}
.listingblock pre>code{display:block}
.listingblock code[data-lang]::before{display:none;content:attr(data-lang);position:absolute;font-size:.75em;top:.425rem;right:.5rem;line-height:1;text-transform:uppercase;color:inherit;opacity:.5}
.listingblock:hover code[data-lang]::before{display:block}
.listingblock.terminal pre .command::before{content:attr(data-prompt);padding-right:.5em;color:inherit;opacity:.5}
.listingblock.terminal pre .command:not([data-prompt])::before{content:"$"}
.listingblock pre.highlightjs{padding:0}
.listingblock pre.highlightjs>code{padding:1em;border-radius:4px}
.listingblock pre.prettyprint{border-width:0}
.prettyprint{background:#f7f7f8}
pre.prettyprint .linenums{line-height:1.45;margin-left:2em}
pre.prettyprint li{background:none;list-style-type:inherit;padding-left:0}
pre.prettyprint li code[data-lang]::before{opacity:1}
pre.prettyprint li:not(:first-child) code[data-lang]::before{display:none}
table.linenotable{border-collapse:separate;border:0;margin-bottom:0;background:none}
table.linenotable td[class]{color:inherit;vertical-align:top;padding:0;line-height:inherit;white-space:normal}
table.linenotable td.code{padding-left:.75em}
table.linenotable td.linenos,pre.pygments .linenos{border-right:1px solid;opacity:.35;padding-right:.5em;-webkit-user-select:none;-moz-user-select:none;-ms-user-select:none;user-select:none}
pre.pygments span.linenos{display:inline-block;margin-right:.75em}
.quoteblock{margin:0 1em 1.25em 1.5em;display:table}
.quoteblock:not(.excerpt)>.title{margin-left:-1.5em;margin-bottom:.75em}
.quoteblock blockquote,.quoteblock p{color:rgba(0,0,0,.85);font-size:1.15rem;line-height:1.75;word-spacing:.1em;letter-spacing:0;font-style:italic;text-align:justify}
.quoteblock blockquote{margin:0;padding:0;border:0}
.quoteblock blockquote::before{content:"\201c";float:left;font-size:2.75em;font-weight:bold;line-height:.6em;margin-left:-.6em;color:#7a2518;text-shadow:0 1px 2px rgba(0,0,0,.1)}
.quoteblock blockquote>.paragraph:last-child p{margin-bottom:0}
.quoteblock .attribution{margin-top:.75em;margin-right:.5ex;text-align:right}
.verseblock{margin:0 1em 1.25em}
.verseblock pre{font-family:"Open Sans","DejaVu Sans",sans-serif;font-size:1.15rem;color:rgba(0,0,0,.85);font-weight:300;text-rendering:optimizeLegibility}
.verseblock pre strong{font-weight:400}
.verseblock .attribution{margin-top:1.25rem;margin-left:.5ex}
.quoteblock .attribution,.verseblock .attribution{font-size:.9375em;line-height:1.45;font-style:italic}
.quoteblock .attribution br,.verseblock .attribution br{display:none}
.quoteblock .attribution cite,.verseblock .attribution cite{display:block;letter-spacing:-.025em;color:rgba(0,0,0,.6)}
.quoteblock.abstract blockquote::before,.quoteblock.excerpt blockquote::before,.quoteblock .quoteblock blockquote::before{display:none}
.quoteblock.abstract blockquote,.quoteblock.abstract p,.quoteblock.excerpt blockquote,.quoteblock.excerpt p,.quoteblock .quoteblock blockquote,.quoteblock .quoteblock p{line-height:1.6;word-spacing:0}
.quoteblock.abstract{margin:0 1em 1.25em;display:block}
.quoteblock.abstract>.title{margin:0 0 .375em;font-size:1.15em;text-align:center}
.quoteblock.excerpt>blockquote,.quoteblock .quoteblock{padding:0 0 .25em 1em;border-left:.25em solid #dddddf}
.quoteblock.excerpt,.quoteblock .quoteblock{margin-left:0}
.quoteblock.excerpt blockquote,.quoteblock.excerpt p,.quoteblock .quoteblock blockquote,.quoteblock .quoteblock p{color:inherit;font-size:1.0625rem}
.quoteblock.excerpt .attribution,.quoteblock .quoteblock .attribution{color:inherit;font-size:.85rem;text-align:left;margin-right:0}
p.tableblock:last-child{margin-bottom:0}
td.tableblock>.content{margin-bottom:1.25em;word-wrap:anywhere}
td.tableblock>.content>:last-child{margin-bottom:-1.25em}
table.tableblock,th.tableblock,td.tableblock{border:0 solid #dedede}
table.grid-all>*>tr>*{border-width:1px}
table.grid-cols>*>tr>*{border-width:0 1px}
table.grid-rows>*>tr>*{border-width:1px 0}
table.frame-all{border-width:1px}
table.frame-ends{border-width:1px 0}
table.frame-sides{border-width:0 1px}
table.frame-none>colgroup+*>:first-child>*,table.frame-sides>colgroup+*>:first-child>*{border-top-width:0}
table.frame-none>:last-child>:last-child>*,table.frame-sides>:last-child>:last-child>*{border-bottom-width:0}
table.frame-none>*>tr>:first-child,table.frame-ends>*>tr>:first-child{border-left-width:0}
table.frame-none>*>tr>:last-child,table.frame-ends>*>tr>:last-child{border-right-width:0}
table.stripes-all>*>tr,table.stripes-odd>*>tr:nth-of-type(odd),table.stripes-even>*>tr:nth-of-type(even),table.stripes-hover>*>tr:hover{background:#f8f8f7}
th.halign-left,td.halign-left{text-align:left}
th.halign-right,td.halign-right{text-align:right}
th.halign-center,td.halign-center{text-align:center}
th.valign-top,td.valign-top{vertical-align:top}
th.valign-bottom,td.valign-bottom{vertical-align:bottom}
th.valign-middle,td.valign-middle{vertical-align:middle}
table thead th,table tfoot th{font-weight:bold}
tbody tr th{background:#f7f8f7}
tbody tr th,tbody tr th p,tfoot tr th,tfoot tr th p{color:rgba(0,0,0,.8);font-weight:bold}
p.tableblock>code:only-child{background:none;padding:0}
p.tableblock{font-size:1em}
ol{margin-left:1.75em}
ul li ol{margin-left:1.5em}
dl dd{margin-left:1.125em}
dl dd:last-child,dl dd:last-child>:last-child{margin-bottom:0}
li p,ul dd,ol dd,.olist .olist,.ulist .ulist,.ulist .olist,.olist .ulist{margin-bottom:.625em}
ul.checklist,ul.none,ol.none,ul.no-bullet,ol.no-bullet,ol.unnumbered,ul.unstyled,ol.unstyled{list-style-type:none}
ul.no-bullet,ol.no-bullet,ol.unnumbered{margin-left:.625em}
ul.unstyled,ol.unstyled{margin-left:0}
li>p:empty:only-child::before{content:"";display:inline-block}
ul.checklist>li>p:first-child{margin-left:-1em}
ul.checklist>li>p:first-child>.fa-square-o:first-child,ul.checklist>li>p:first-child>.fa-check-square-o:first-child{width:1.25em;font-size:.8em;position:relative;bottom:.125em}
ul.checklist>li>p:first-child>input[type=checkbox]:first-child{margin-right:.25em}
ul.inline{display:flex;flex-flow:row wrap;list-style:none;margin:0 0 .625em -1.25em}
ul.inline>li{margin-left:1.25em}
.unstyled dl dt{font-weight:400;font-style:normal}
ol.arabic{list-style-type:decimal}
ol.decimal{list-style-type:decimal-leading-zero}
ol.loweralpha{list-style-type:lower-alpha}
ol.upperalpha{list-style-type:upper-alpha}
ol.lowerroman{list-style-type:lower-roman}
ol.upperroman{list-style-type:upper-roman}
ol.lowergreek{list-style-type:lower-greek}
.hdlist>table,.colist>table{border:0;background:none}
.hdlist>table>tbody>tr,.colist>table>tbody>tr{background:none}
td.hdlist1,td.hdlist2{vertical-align:top;padding:0 .625em}
td.hdlist1{font-weight:bold;padding-bottom:1.25em}
td.hdlist2{word-wrap:anywhere}
.literalblock+.colist,.listingblock+.colist{margin-top:-.5em}
.colist td:not([class]):first-child{padding:.4em .75em 0;line-height:1;vertical-align:top}
.colist td:not([class]):first-child img{max-width:none}
.colist td:not([class]):last-child{padding:.25em 0}
.thumb,.th{line-height:0;display:inline-block;border:4px solid #fff;box-shadow:0 0 0 1px #ddd}
.imageblock.left{margin:.25em .625em 1.25em 0}
.imageblock.right{margin:.25em 0 1.25em .625em}
.imageblock>.title{margin-bottom:0}
.imageblock.thumb,.imageblock.th{border-width:6px}
.imageblock.thumb>.title,.imageblock.th>.title{padding:0 .125em}
.image.left,.image.right{margin-top:.25em;margin-bottom:.25em;display:inline-block;line-height:0}
.image.left{margin-right:.625em}
.image.right{margin-left:.625em}
a.image{text-decoration:none;display:inline-block}
a.image object{pointer-events:none}
sup.footnote,sup.footnoteref{font-size:.875em;position:static;vertical-align:super}
sup.footnote a,sup.footnoteref a{text-decoration:none}
sup.footnote a:active,sup.footnoteref a:active,#footnotes .footnote a:first-of-type:active{text-decoration:underline}
#footnotes{padding-top:.75em;padding-bottom:.75em;margin-bottom:.625em}
#footnotes hr{width:20%;min-width:6.25em;margin:-.25em 0 .75em;border-width:1px 0 0}
#footnotes .footnote{padding:0 .375em 0 .225em;line-height:1.3334;font-size:.875em;margin-left:1.2em;margin-bottom:.2em}
#footnotes .footnote a:first-of-type{font-weight:bold;text-decoration:none;margin-left:-1.05em}
#footnotes .footnote:last-of-type{margin-bottom:0}
#content #footnotes{margin-top:-.625em;margin-bottom:0;padding:.75em 0}
div.unbreakable{page-break-inside:avoid}
.big{font-size:larger}
.small{font-size:smaller}
.underline{text-decoration:underline}
.overline{text-decoration:overline}
.line-through{text-decoration:line-through}
.aqua{color:#00bfbf}
.aqua-background{background:#00fafa}
.black{color:#000}
.black-background{background:#000}
.blue{color:#0000bf}
.blue-background{background:#0000fa}
.fuchsia{color:#bf00bf}
.fuchsia-background{background:#fa00fa}
.gray{color:#606060}
.gray-background{background:#7d7d7d}
.green{color:#006000}
.green-background{background:#007d00}
.lime{color:#00bf00}
.lime-background{background:#00fa00}
.maroon{color:#600000}
.maroon-background{background:#7d0000}
.navy{color:#000060}
.navy-background{background:#00007d}
.olive{color:#606000}
.olive-background{background:#7d7d00}
.purple{color:#600060}
.purple-background{background:#7d007d}
.red{color:#bf0000}
.red-background{background:#fa0000}
.silver{color:#909090}
.silver-background{background:#bcbcbc}
.teal{color:#006060}
.teal-background{background:#007d7d}
.white{color:#bfbfbf}
.white-background{background:#fafafa}
.yellow{color:#bfbf00}
.yellow-background{background:#fafa00}
span.icon>.fa{cursor:default}
a span.icon>.fa{cursor:inherit}
.admonitionblock td.icon [class^="fa icon-"]{font-size:2.5em;text-shadow:1px 1px 2px rgba(0,0,0,.5);cursor:default}
.admonitionblock td.icon .icon-note::before{content:"\f05a";color:#19407c}
.admonitionblock td.icon .icon-tip::before{content:"\f0eb";text-shadow:1px 1px 2px rgba(155,155,0,.8);color:#111}
.admonitionblock td.icon .icon-warning::before{content:"\f071";color:#bf6900}
.admonitionblock td.icon .icon-caution::before{content:"\f06d";color:#bf3400}
.admonitionblock td.icon .icon-important::before{content:"\f06a";color:#bf0000}
.conum[data-value]{display:inline-block;color:#fff!important;background:rgba(0,0,0,.8);border-radius:50%;text-align:center;font-size:.75em;width:1.67em;height:1.67em;line-height:1.67em;font-family:"Open Sans","DejaVu Sans",sans-serif;font-style:normal;font-weight:bold}
.conum[data-value] *{color:#fff!important}
.conum[data-value]+b{display:none}
.conum[data-value]::after{content:attr(data-value)}
pre .conum[data-value]{position:relative;top:-.125em}
b.conum *{color:inherit!important}
.conum:not([data-value]):empty{display:none}
dt,th.tableblock,td.content,div.footnote{text-rendering:optimizeLegibility}
h1,h2,p,td.content,span.alt,summary{letter-spacing:-.01em}
p strong,td.content strong,div.footnote strong{letter-spacing:-.005em}
p,blockquote,dt,td.content,td.hdlist1,span.alt,summary{font-size:1.0625rem}
p{margin-bottom:1.25rem}
.sidebarblock p,.sidebarblock dt,.sidebarblock td.content,p.tableblock{font-size:1em}
.exampleblock>.content{background:#fffef7;border-color:#e0e0dc;box-shadow:0 1px 4px #e0e0dc}
.print-only{display:none!important}
@page{margin:1.25cm .75cm}
@media print{*{box-shadow:none!important;text-shadow:none!important}
html{font-size:80%}
a{color:inherit!important;text-decoration:underline!important}
a.bare,a[href^="#"],a[href^="mailto:"]{text-decoration:none!important}
a[href^="http:"]:not(.bare)::after,a[href^="https:"]:not(.bare)::after{content:"(" attr(href) ")";display:inline-block;font-size:.875em;padding-left:.25em}
abbr[title]{border-bottom:1px dotted}
abbr[title]::after{content:" (" attr(title) ")"}
pre,blockquote,tr,img,object,svg{page-break-inside:avoid}
thead{display:table-header-group}
svg{max-width:100%}
p,blockquote,dt,td.content{font-size:1em;orphans:3;widows:3}
h2,h3,#toctitle,.sidebarblock>.content>.title{page-break-after:avoid}
#header,#content,#footnotes,#footer{max-width:none}
#toc,.sidebarblock,.exampleblock>.content{background:none!important}
#toc{border-bottom:1px solid #dddddf!important;padding-bottom:0!important}
body.book #header{text-align:center}
body.book #header>h1:first-child{border:0!important;margin:2.5em 0 1em}
body.book #header .details{border:0!important;display:block;padding:0!important}
body.book #header .details span:first-child{margin-left:0!important}
body.book #header .details br{display:block}
body.book #header .details br+span::before{content:none!important}
body.book #toc{border:0!important;text-align:left!important;padding:0!important;margin:0!important}
body.book #toc,body.book #preamble,body.book h1.sect0,body.book .sect1>h2{page-break-before:always}
.listingblock code[data-lang]::before{display:block}
#footer{padding:0 .9375em}
.hide-on-print{display:none!important}
.print-only{display:block!important}
.hide-for-print{display:none!important}
.show-for-print{display:inherit!important}}
@media amzn-kf8,print{#header>h1:first-child{margin-top:1.25rem}
.sect1{padding:0!important}
.sect1+.sect1{border:0}
#footer{background:none}
#footer-text{color:rgba(0,0,0,.6);font-size:.9em}}
@media amzn-kf8{#header,#content,#footnotes,#footer{padding:0}}
</style>
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/4.7.0/css/font-awesome.min.css">
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/highlight.js/11.8.0/styles/atom-one-light.min.css">
</head>
<body class="book">
<div id="header">
<h1>Curso de Bases de Datos Vectoriales y de Grafos</h1>
<div id="toc" class="toc">
<div id="toctitle">Table of Contents</div>
<ul class="sectlevel1">
<li><a href="#_introducción">1. Introducción</a></li>
<li><a href="#_parte_i_bases_de_datos_vectoriales">2. PARTE I: BASES DE DATOS VECTORIALES</a></li>
<li><a href="#_módulo_1_fundamentos_de_bases_de_datos_vectoriales">3. Módulo 1: Fundamentos de Bases de Datos Vectoriales</a>
<ul class="sectlevel2">
<li><a href="#_1_1_qué_son_vectores_en_bases_de_datos">3.1. 1.1 ¿Qué son Vectores en Bases de Datos?</a></li>
<li><a href="#_1_2_similitud_en_espacios_vectoriales">3.2. 1.2 Similitud en Espacios Vectoriales</a></li>
<li><a href="#_1_3_ventajas_de_bases_de_datos_vectoriales">3.3. 1.3 Ventajas de Bases de Datos Vectoriales</a></li>
<li><a href="#_1_4_casos_de_uso">3.4. 1.4 Casos de Uso</a></li>
</ul>
</li>
<li><a href="#_módulo_2_chromadb_base_de_datos_vectorial_local">4. Módulo 2: ChromaDB - Base de Datos Vectorial Local</a>
<ul class="sectlevel2">
<li><a href="#_2_1_instalación_y_configuración">4.1. 2.1 Instalación y Configuración</a></li>
<li><a href="#_2_2_chromadb_básico">4.2. 2.2 ChromaDB Básico</a></li>
<li><a href="#_2_3_chromadb_con_langchain">4.3. 2.3 ChromaDB con LangChain</a></li>
<li><a href="#_2_4_operaciones_avanzadas_en_chromadb">4.4. 2.4 Operaciones Avanzadas en ChromaDB</a></li>
<li><a href="#_2_5_configuraciones_avanzadas_de_chromadb">4.5. 2.5 Configuraciones Avanzadas de ChromaDB</a>
<ul class="sectlevel3">
<li><a href="#_modos_de_operación">4.5.1. Modos de Operación</a></li>
<li><a href="#_funciones_de_distancia">4.5.2. Funciones de Distancia</a></li>
<li><a href="#_embeddings_personalizados">4.5.3. Embeddings Personalizados</a></li>
</ul>
</li>
<li><a href="#_2_6_operaciones_crud_avanzadas">4.6. 2.6 Operaciones CRUD Avanzadas</a></li>
<li><a href="#_2_7_chromadb_con_ollama_embeddings_locales">4.7. 2.7 ChromaDB con Ollama (Embeddings Locales)</a></li>
<li><a href="#_2_8_sistema_rag_completo_con_chromadb">4.8. 2.8 Sistema RAG Completo con ChromaDB</a></li>
<li><a href="#_2_9_casos_de_uso_prácticos_con_chromadb">4.9. 2.9 Casos de Uso Prácticos con ChromaDB</a>
<ul class="sectlevel3">
<li><a href="#_búsqueda_semántica_de_código">4.9.1. Búsqueda Semántica de Código</a></li>
<li><a href="#_sistema_de_recomendación_de_contenido">4.9.2. Sistema de Recomendación de Contenido</a></li>
<li><a href="#_detección_de_duplicados_y_plagio">4.9.3. Detección de Duplicados y Plagio</a></li>
</ul>
</li>
<li><a href="#_2_10_performance_y_optimización_en_chromadb">4.10. 2.10 Performance y Optimización en ChromaDB</a>
<ul class="sectlevel3">
<li><a href="#_configuración_de_hnsw_index">4.10.1. Configuración de HNSW Index</a></li>
<li><a href="#_batch_operations">4.10.2. Batch Operations</a></li>
<li><a href="#_monitoreo_y_estadísticas">4.10.3. Monitoreo y Estadísticas</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#_módulo_3_weaviate_base_de_datos_vectorial_graphql">5. Módulo 3: Weaviate - Base de Datos Vectorial GraphQL</a>
<ul class="sectlevel2">
<li><a href="#_3_1_instalación">5.1. 3.1 Instalación</a></li>
<li><a href="#_3_2_configuración_básica">5.2. 3.2 Configuración Básica</a></li>
<li><a href="#_3_3_weaviate_con_langchain">5.3. 3.3 Weaviate con LangChain</a></li>
</ul>
</li>
<li><a href="#_módulo_4_qdrant_base_de_datos_vectorial_rápida">6. Módulo 4: Qdrant - Base de Datos Vectorial Rápida</a>
<ul class="sectlevel2">
<li><a href="#_4_1_instalación">6.1. 4.1 Instalación</a></li>
<li><a href="#_4_2_configuración_básica">6.2. 4.2 Configuración Básica</a></li>
<li><a href="#_4_3_qdrant_con_langchain">6.3. 4.3 Qdrant con LangChain</a></li>
</ul>
</li>
<li><a href="#_módulo_5_milvus_base_de_datos_vectorial_de_alto_rendimiento">7. Módulo 5: Milvus - Base de Datos Vectorial de Alto Rendimiento</a>
<ul class="sectlevel2">
<li><a href="#_5_1_instalación">7.1. 5.1 Instalación</a></li>
<li><a href="#_5_2_configuración_básica">7.2. 5.2 Configuración Básica</a></li>
<li><a href="#_5_3_milvus_con_langchain">7.3. 5.3 Milvus con LangChain</a></li>
</ul>
</li>
<li><a href="#_módulo_6_comparativa_de_bases_de_datos_vectoriales">8. Módulo 6: Comparativa de Bases de Datos Vectoriales</a>
<ul class="sectlevel2">
<li><a href="#_6_1_matriz_comparativa_completa">8.1. 6.1 Matriz Comparativa Completa</a></li>
<li><a href="#_6_2_análisis_detallado_por_caso_de_uso">8.2. 6.2 Análisis Detallado por Caso de Uso</a>
<ul class="sectlevel3">
<li><a href="#_chromadb_la_opción_ideal_para_desarrollo_local">8.2.1. ChromaDB: La Opción Ideal para Desarrollo Local</a></li>
<li><a href="#_weaviate_balance_de_features_y_escalabilidad">8.2.2. Weaviate: Balance de Features y Escalabilidad</a></li>
<li><a href="#_milvus_el_gigante_de_escalabilidad">8.2.3. Milvus: El Gigante de Escalabilidad</a></li>
<li><a href="#_qdrant_el_balance_perfecto_para_producción">8.2.4. Qdrant: El Balance Perfecto para Producción</a></li>
</ul>
</li>
<li><a href="#_6_3_decisión_cuál_elegir">8.3. 6.3 Decisión: ¿Cuál Elegir?</a>
<ul class="sectlevel3">
<li><a href="#_árbol_de_decisión">8.3.1. Árbol de Decisión</a></li>
<li><a href="#_matriz_de_decisión_por_equipo">8.3.2. Matriz de Decisión por Equipo</a></li>
</ul>
</li>
<li><a href="#_6_4_benchmarks_reales_con_ollama">8.4. 6.4 Benchmarks Reales (con Ollama)</a></li>
<li><a href="#_6_5_estrategia_híbrida_múltiples_bases_de_datos">8.5. 6.5 Estrategia Híbrida: Múltiples Bases de Datos</a></li>
<li><a href="#_6_6_migración_entre_bases_de_datos">8.6. 6.6 Migración Entre Bases de Datos</a>
<ul class="sectlevel3">
<li><a href="#_chromadb_qdrant">8.6.1. ChromaDB → Qdrant</a></li>
<li><a href="#_weaviate_milvus">8.6.2. Weaviate → Milvus</a></li>
</ul>
</li>
<li><a href="#_6_7_recomendaciones_finales">8.7. 6.7 Recomendaciones Finales</a></li>
</ul>
</li>
<li><a href="#_parte_ii_bases_de_datos_de_grafos">9. PARTE II: BASES DE DATOS DE GRAFOS</a></li>
<li><a href="#_módulo_7_fundamentos_de_bases_de_datos_de_grafos">10. Módulo 7: Fundamentos de Bases de Datos de Grafos</a>
<ul class="sectlevel2">
<li><a href="#_7_1_conceptos_básicos_una_nueva_forma_de_pensar">10.1. 7.1 Conceptos Básicos: Una Nueva Forma de Pensar</a></li>
<li><a href="#_7_2_tipos_de_grafos_explicados">10.2. 7.2 Tipos de Grafos Explicados</a>
<ul class="sectlevel3">
<li><a href="#_grafo_dirigido">10.2.1. Grafo Dirigido</a></li>
<li><a href="#_grafo_no_dirigido">10.2.2. Grafo No Dirigido</a></li>
<li><a href="#_grafo_ponderado">10.2.3. Grafo Ponderado</a></li>
<li><a href="#_grafo_heterogéneo">10.2.4. Grafo Heterogéneo</a></li>
</ul>
</li>
<li><a href="#_7_3_conceptos_avanzados">10.3. 7.3 Conceptos Avanzados</a>
<ul class="sectlevel3">
<li><a href="#_caminos_y_recorridos">10.3.1. Caminos y Recorridos</a></li>
<li><a href="#_centralidad_en_grafos">10.3.2. Centralidad en Grafos</a></li>
<li><a href="#_detección_de_comunidades">10.3.3. Detección de Comunidades</a></li>
</ul>
</li>
<li><a href="#_7_4_ventajas_de_grafos_vs_otras_estructuras">10.4. 7.4 Ventajas de Grafos vs Otras Estructuras</a></li>
<li><a href="#_7_5_casos_de_uso_prácticos">10.5. 7.5 Casos de Uso Prácticos</a>
<ul class="sectlevel3">
<li><a href="#_red_social_facebook_linkedin">10.5.1. Red Social (Facebook, LinkedIn)</a></li>
<li><a href="#_sistema_de_recomendación">10.5.2. Sistema de Recomendación</a></li>
<li><a href="#_base_de_conocimiento">10.5.3. Base de Conocimiento</a></li>
<li><a href="#_detección_de_fraude">10.5.4. Detección de Fraude</a></li>
<li><a href="#_gestión_de_dependencias">10.5.5. Gestión de Dependencias</a></li>
</ul>
</li>
<li><a href="#_7_6_grafos_vs_vectores_cuándo_usar_cada_uno">10.6. 7.6 Grafos vs Vectores: ¿Cuándo Usar Cada Uno?</a></li>
</ul>
</li>
<li><a href="#_módulo_8_neo4j_base_de_datos_de_grafos_líder">11. Módulo 8: Neo4j - Base de Datos de Grafos Líder</a>
<ul class="sectlevel2">
<li><a href="#_8_1_instalación">11.1. 8.1 Instalación</a></li>
<li><a href="#_8_2_lenguaje_cypher_básico">11.2. 8.2 Lenguaje Cypher Básico</a></li>
<li><a href="#_8_3_neo4j_con_python">11.3. 8.3 Neo4j con Python</a></li>
<li><a href="#_8_4_neo4j_con_langchain">11.4. 8.4 Neo4j con LangChain</a></li>
<li><a href="#_8_5_modelado_de_datos_en_grafos">11.5. 8.5 Modelado de Datos en Grafos</a>
<ul class="sectlevel3">
<li><a href="#_principios_de_modelado">11.5.1. Principios de Modelado</a></li>
<li><a href="#_ejemplo_completo_red_social">11.5.2. Ejemplo Completo: Red Social</a></li>
</ul>
</li>
<li><a href="#_8_6_patrones_de_cypher_avanzados">11.6. 8.6 Patrones de Cypher Avanzados</a>
<ul class="sectlevel3">
<li><a href="#_consultas_complejas">11.6.1. Consultas Complejas</a></li>
<li><a href="#_agregaciones_y_análisis">11.6.2. Agregaciones y Análisis</a></li>
</ul>
</li>
<li><a href="#_8_7_casos_de_uso_completos">11.7. 8.7 Casos de Uso Completos</a>
<ul class="sectlevel3">
<li><a href="#_caso_1_sistema_de_e_commerce">11.7.1. Caso 1: Sistema de E-Commerce</a></li>
<li><a href="#_caso_2_detección_de_fraude">11.7.2. Caso 2: Detección de Fraude</a></li>
</ul>
</li>
<li><a href="#_8_8_algoritmos_de_grafos_en_neo4j">11.8. 8.8 Algoritmos de Grafos en Neo4j</a>
<ul class="sectlevel3">
<li><a href="#_graph_data_science_library_gds">11.8.1. Graph Data Science Library (GDS)</a></li>
</ul>
</li>
<li><a href="#_8_9_integración_avanzada_con_langchain_y_ollama">11.9. 8.9 Integración Avanzada con LangChain y Ollama</a></li>
<li><a href="#_8_10_optimización_y_mejores_prácticas">11.10. 8.10 Optimización y Mejores Prácticas</a>
<ul class="sectlevel3">
<li><a href="#_índices_y_constraints">11.10.1. Índices y Constraints</a></li>
<li><a href="#_optimización_de_queries">11.10.2. Optimización de Queries</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#_módulo_9_arangodb_base_de_datos_multi_modelo">12. Módulo 9: ArangoDB - Base de Datos Multi-Modelo</a>
<ul class="sectlevel2">
<li><a href="#_9_1_características">12.1. 9.1 Características</a></li>
<li><a href="#_9_2_instalación">12.2. 9.2 Instalación</a></li>
<li><a href="#_9_3_aql_arangodb_query_language">12.3. 9.3 AQL (ArangoDB Query Language)</a></li>
</ul>
</li>
<li><a href="#_módulo_10_knowledge_graphs_con_langchain">13. Módulo 10: Knowledge Graphs con LangChain</a>
<ul class="sectlevel2">
<li><a href="#_10_1_crear_knowledge_graph_desde_texto">13.1. 10.1 Crear Knowledge Graph desde Texto</a></li>
<li><a href="#_10_2_qa_sobre_grafo">13.2. 10.2 QA sobre Grafo</a></li>
</ul>
</li>
<li><a href="#_módulo_11_búsqueda_híbrida_vectorial_grafos">14. Módulo 11: Búsqueda Híbrida (Vectorial + Grafos)</a>
<ul class="sectlevel2">
<li><a href="#_11_1_hybrid_rag">14.1. 11.1 Hybrid RAG</a></li>
</ul>
</li>
<li><a href="#_módulo_12_casos_de_uso_avanzados">15. Módulo 12: Casos de Uso Avanzados</a>
<ul class="sectlevel2">
<li><a href="#_12_1_sistema_de_recomendación">15.1. 12.1 Sistema de Recomendación</a></li>
<li><a href="#_12_2_detección_de_fraude">15.2. 12.2 Detección de Fraude</a></li>
</ul>
</li>
<li><a href="#_módulo_13_optimización_y_producción">16. Módulo 13: Optimización y Producción</a>
<ul class="sectlevel2">
<li><a href="#_13_1_índices_en_neo4j">16.1. 13.1 Índices en Neo4j</a></li>
<li><a href="#_13_2_caché_de_consultas">16.2. 13.2 Caché de Consultas</a></li>
</ul>
</li>
<li><a href="#_módulo_14_proyecto_final_sistema_integral">17. Módulo 14: Proyecto Final - Sistema Integral</a>
<ul class="sectlevel2">
<li><a href="#_14_1_arquitectura_del_proyecto">17.1. 14.1 Arquitectura del Proyecto</a></li>
<li><a href="#_14_2_estructura_del_código">17.2. 14.2 Estructura del Código</a></li>
</ul>
</li>
<li><a href="#_anexo_a_comparativa_vectorial_vs_grafo">18. Anexo A: Comparativa Vectorial vs Grafo</a></li>
<li><a href="#_anexo_b_stack_recomendado">19. Anexo B: Stack Recomendado</a></li>
<li><a href="#_anexo_c_recursos">20. Anexo C: Recursos</a></li>
</ul>
</div>
</div>
<div id="content">
<div class="sect1">
<h2 id="_introducción">1. Introducción</h2>
<div class="sectionbody">
<div class="paragraph">
<p>Este curso cubre la implementación de <strong>sistemas avanzados de almacenamiento</strong> usando bases de datos vectoriales y de grafos con LangChain y Ollama en local. Aprenderás a construir aplicaciones complejas que combinan búsqueda semántica con relaciones entre entidades.</p>
</div>
</div>
</div>
<div class="sect1">
<h2 id="_parte_i_bases_de_datos_vectoriales">2. PARTE I: BASES DE DATOS VECTORIALES</h2>
<div class="sectionbody">

</div>
</div>
<div class="sect1">
<h2 id="_módulo_1_fundamentos_de_bases_de_datos_vectoriales">3. Módulo 1: Fundamentos de Bases de Datos Vectoriales</h2>
<div class="sectionbody">
<div class="sect2">
<h3 id="_1_1_qué_son_vectores_en_bases_de_datos">3.1. 1.1 ¿Qué son Vectores en Bases de Datos?</h3>
<div class="paragraph">
<p><strong>Concepto Fundamental:</strong>
- Representación numérica multidimensional de datos
- Cada elemento es un número en un espacio n-dimensional
- Típicamente 384 a 1536 dimensiones
- Basados en embeddings (convertir texto → números)</p>
</div>
<div class="paragraph">
<p><strong>Ejemplo Visual:</strong></p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-text hljs" data-lang="text">Texto: "gato"
Vector: [0.234, -0.156, 0.891, ..., 0.445]  # 1536 dimensiones
Texto: "felino"
Vector: [0.241, -0.149, 0.887, ..., 0.452]  # Muy similar al anterior</code></pre>
</div>
</div>
</div>
<div class="sect2">
<h3 id="_1_2_similitud_en_espacios_vectoriales">3.2. 1.2 Similitud en Espacios Vectoriales</h3>
<div class="paragraph">
<p><strong>Similitud Coseno:</strong>
- Mide el ángulo entre dos vectores
- Rango: -1 a 1 (1 = idénticos)
- Usada en búsqueda semántica</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-text hljs" data-lang="text">Similitud(v1, v2) = (v1 · v2) / (||v1|| × ||v2||)</code></pre>
</div>
</div>
<div class="paragraph">
<p><strong>Distancia Euclidiana:</strong>
- Distancia recta entre dos puntos
- Rango: 0 a infinito (0 = idénticos)</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-text hljs" data-lang="text">Distancia = √((x1-x2)² + (y1-y2)² + ... + (zn-z'n)²)</code></pre>
</div>
</div>
<div class="paragraph">
<p><strong>Distancia Manhattan:</strong>
- Suma de diferencias absolutas
- Más rápida que Euclidiana</p>
</div>
</div>
<div class="sect2">
<h3 id="_1_3_ventajas_de_bases_de_datos_vectoriales">3.3. 1.3 Ventajas de Bases de Datos Vectoriales</h3>
<div class="ulist">
<ul>
<li>
<p>Búsqueda Semántica: No necesita coincidencia exacta</p>
</li>
<li>
<p>Escalabilidad: Millones de vectores en tiempo real</p>
</li>
<li>
<p>Eficiencia: Indexación especializada (HNSW, IVF)</p>
</li>
<li>
<p>Flexibilidad: Cualquier tipo de dato convertible a vector</p>
</li>
<li>
<p>Rapidez: Búsquedas en milisegundos</p>
</li>
<li>
<p>Relevancia: Basada en significado, no keywords</p>
</li>
</ul>
</div>
</div>
<div class="sect2">
<h3 id="_1_4_casos_de_uso">3.4. 1.4 Casos de Uso</h3>
<div class="ulist">
<ul>
<li>
<p>Recomendadores (películas, productos)</p>
</li>
<li>
<p>Búsqueda semántica en documentos</p>
</li>
<li>
<p>Detección de duplicados</p>
</li>
<li>
<p>Clasificación de textos</p>
</li>
<li>
<p>Análisis de similitud</p>
</li>
<li>
<p>Sistemas de RAG avanzados</p>
</li>
</ul>
</div>
</div>
</div>
</div>
<div class="sect1">
<h2 id="_módulo_2_chromadb_base_de_datos_vectorial_local">4. Módulo 2: ChromaDB - Base de Datos Vectorial Local</h2>
<div class="sectionbody">
<div class="paragraph">
<p><strong>ChromaDB</strong> es la base de datos vectorial de código abierto más popular para desarrollo local y prototipos rápidos. Su filosofía es "embeddings made simple" - hacer que trabajar con vectores sea tan fácil como trabajar con SQL.</p>
</div>
<div class="paragraph">
<p><strong>¿Por qué ChromaDB?</strong></p>
</div>
<div class="ulist">
<ul>
<li>
<p><strong>Zero configuration</strong>: Funciona sin configuración compleja</p>
</li>
<li>
<p><strong>Python-first</strong>: API diseñada para científicos de datos</p>
</li>
<li>
<p><strong>Embeddings automáticos</strong>: Genera vectores automáticamente</p>
</li>
<li>
<p><strong>Persistencia local</strong>: Datos en disco sin servidores</p>
</li>
<li>
<p><strong>Integración perfecta</strong>: LangChain, LlamaIndex, Haystack</p>
</li>
</ul>
</div>
<div class="sect2">
<h3 id="_2_1_instalación_y_configuración">4.1. 2.1 Instalación y Configuración</h3>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-bash hljs" data-lang="bash"># Instalación básica
pip install chromadb

# Con LangChain
pip install langchain-chroma

# Dependencias opcionales para embeddings
pip install sentence-transformers  # Para embeddings locales
pip install openai  # Para embeddings de OpenAI</code></pre>
</div>
</div>
<div class="paragraph">
<p><strong>Arquitectura de ChromaDB:</strong></p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-text hljs" data-lang="text">┌─────────────────────────────────────┐
│   API Cliente (Python, JS)          │
└──────────────┬──────────────────────┘
               │
┌──────────────▼──────────────────────┐
│   ChromaDB Core Engine              │
│   - Gestión de colecciones          │
│   - Indexación HNSW                 │
│   - Búsqueda de similitud           │
└──────────────┬──────────────────────┘
               │
┌──────────────▼──────────────────────┐
│   Capa de Persistencia              │
│   - DuckDB (metadata)               │
│   - Parquet (vectores)              │
│   - SQLite (alternativa)            │
└─────────────────────────────────────┘</code></pre>
</div>
</div>
</div>
<div class="sect2">
<h3 id="_2_2_chromadb_básico">4.2. 2.2 ChromaDB Básico</h3>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-python hljs" data-lang="python">import chromadb
from chromadb.config import Settings

# Modo en memoria (para desarrollo)
client = chromadb.Client()

# Modo persistente (recomendado)
settings = Settings(
    chroma_db_impl="duckdb+parquet",
    persist_directory="./chroma_data",
    anonymized_telemetry=False
)
client = chromadb.Client(settings)

# Crear colección
collection = client.create_collection(name="documentos")

# Agregar documentos con embeddings
collection.add(
    ids=["id1", "id2"],
    documents=["Texto 1", "Texto 2"],
    metadatas=[{"source": "file1"}, {"source": "file2"}]
)

# Buscar
results = collection.query(
    query_texts=["Buscar este texto"],
    n_results=3
)
print(results)</code></pre>
</div>
</div>
</div>
<div class="sect2">
<h3 id="_2_3_chromadb_con_langchain">4.3. 2.3 ChromaDB con LangChain</h3>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-python hljs" data-lang="python">from langchain_chroma import Chroma
from langchain_ollama import OllamaEmbeddings

# Crear embeddings
embeddings = OllamaEmbeddings(model="nomic-embed-text")

# Crear vector store
vector_store = Chroma(
    collection_name="mi_coleccion",
    embedding_function=embeddings,
    persist_directory="./chroma_db"
)

# Agregar documentos
from langchain_core.documents import Document

docs = [
    Document(page_content="Contenido 1", metadata={"source": "doc1"}),
    Document(page_content="Contenido 2", metadata={"source": "doc2"}),
]

vector_store.add_documents(docs)

# Buscar
results = vector_store.similarity_search("búsqueda", k=3)
for doc in results:
    print(doc.page_content)

# Buscar con scores
results_with_scores = vector_store.similarity_search_with_score("búsqueda", k=3)
for doc, score in results_with_scores:
    print(f"Score: {score:.4f} - {doc.page_content}")</code></pre>
</div>
</div>
</div>
<div class="sect2">
<h3 id="_2_4_operaciones_avanzadas_en_chromadb">4.4. 2.4 Operaciones Avanzadas en ChromaDB</h3>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-python hljs" data-lang="python"># Filtrar por metadata
results = vector_store.similarity_search(
    "búsqueda",
    k=3,
    filter={"source": "doc1"}
)

# Actualizar documentos
vector_store.update_document(id="id1", document=new_doc)

# Eliminar documentos
vector_store.delete(["id1", "id2"])

# Obtener información de la colección
collection = vector_store._collection
print(f"Documentos: {collection.count()}")

# Exportar datos
all_docs = collection.get()</code></pre>
</div>
</div>
</div>
<div class="sect2">
<h3 id="_2_5_configuraciones_avanzadas_de_chromadb">4.5. 2.5 Configuraciones Avanzadas de ChromaDB</h3>
<div class="sect3">
<h4 id="_modos_de_operación">4.5.1. Modos de Operación</h4>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-python hljs" data-lang="python">import chromadb
from chromadb.config import Settings

# 1. Modo en memoria (ephemeral) - Para testing
client = chromadb.Client()

# 2. Modo persistente - Para desarrollo
client = chromadb.PersistentClient(path="./mi_base_datos")

# 3. Cliente HTTP - Para producción distribuida
client = chromadb.HttpClient(host="localhost", port=8000)

# 4. Configuración personalizada completa
settings = Settings(
    chroma_db_impl="duckdb+parquet",
    persist_directory="./chroma_storage",
    anonymized_telemetry=False,
    allow_reset=True,
    chroma_api_impl="chromadb.api.segment.SegmentAPI",
)
client = chromadb.Client(settings)</code></pre>
</div>
</div>
</div>
<div class="sect3">
<h4 id="_funciones_de_distancia">4.5.2. Funciones de Distancia</h4>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-python hljs" data-lang="python">from chromadb.utils import embedding_functions

# Colección con cosine similarity (default)
collection_cosine = client.create_collection(
    name="cosine_collection",
    metadata={"hnsw:space": "cosine"}
)

# Colección con distancia euclidiana (L2)
collection_l2 = client.create_collection(
    name="l2_collection",
    metadata={"hnsw:space": "l2"}
)

# Colección con producto interno (inner product)
collection_ip = client.create_collection(
    name="ip_collection",
    metadata={"hnsw:space": "ip"}
)</code></pre>
</div>
</div>
</div>
<div class="sect3">
<h4 id="_embeddings_personalizados">4.5.3. Embeddings Personalizados</h4>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-python hljs" data-lang="python">from chromadb.utils import embedding_functions

# 1. Sentence Transformers (local, gratuito)
sentence_transformer_ef = embedding_functions.SentenceTransformerEmbeddingFunction(
    model_name="all-MiniLM-L6-v2"
)

collection = client.create_collection(
    name="docs_local",
    embedding_function=sentence_transformer_ef
)

# 2. OpenAI Embeddings
openai_ef = embedding_functions.OpenAIEmbeddingFunction(
    api_key="tu-api-key",
    model_name="text-embedding-ada-002"
)

collection_openai = client.create_collection(
    name="docs_openai",
    embedding_function=openai_ef
)

# 3. Hugging Face Embeddings
huggingface_ef = embedding_functions.HuggingFaceEmbeddingFunction(
    api_key="tu-hf-token",
    model_name="sentence-transformers/all-mpnet-base-v2"
)

# 4. Función de embedding personalizada
class CustomEmbeddingFunction:
    def __call__(self, texts):
        # Tu lógica personalizada aquí
        return [[0.1, 0.2, 0.3] for _ in texts]

custom_ef = CustomEmbeddingFunction()
collection_custom = client.create_collection(
    name="docs_custom",
    embedding_function=custom_ef
)</code></pre>
</div>
</div>
</div>
</div>
<div class="sect2">
<h3 id="_2_6_operaciones_crud_avanzadas">4.6. 2.6 Operaciones CRUD Avanzadas</h3>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-python hljs" data-lang="python"># Obtener o crear colección
collection = client.get_or_create_collection(name="mi_coleccion")

# Agregar documentos con metadata rica
collection.add(
    documents=[
        "Python es un lenguaje de programación",
        "JavaScript es usado en web",
        "Machine Learning usa Python"
    ],
    metadatas=[
        {"category": "programming", "language": "python", "level": "beginner"},
        {"category": "web", "language": "javascript", "level": "intermediate"},
        {"category": "ai", "language": "python", "level": "advanced"}
    ],
    ids=["doc1", "doc2", "doc3"]
)

# Búsqueda con filtros complejos
results = collection.query(
    query_texts=["aprender programación"],
    n_results=10,
    where={
        "$and": [
            {"category": "programming"},
            {"level": {"$in": ["beginner", "intermediate"]}}
        ]
    },
    where_document={"$contains": "Python"}
)

# Operadores de filtrado disponibles:
# $eq, $ne, $gt, $gte, $lt, $lte, $in, $nin, $and, $or, $contains

# Actualizar documentos
collection.update(
    ids=["doc1"],
    documents=["Python es un excelente lenguaje de programación"],
    metadatas=[{"category": "programming", "language": "python", "level": "all"}]
)

# Upsert (insertar o actualizar)
collection.upsert(
    ids=["doc4"],
    documents=["Rust es un lenguaje de sistemas"],
    metadatas=[{"category": "systems", "language": "rust"}]
)

# Eliminar por IDs
collection.delete(ids=["doc2"])

# Eliminar por filtro
collection.delete(where={"category": "web"})

# Contar documentos
count = collection.count()
print(f"Total documentos: {count}")

# Peek (ver primeros documentos)
peek = collection.peek(limit=5)
print(peek)

# Obtener todos los documentos
all_items = collection.get(
    where={"language": "python"},
    include=["documents", "metadatas", "embeddings"]
)</code></pre>
</div>
</div>
</div>
<div class="sect2">
<h3 id="_2_7_chromadb_con_ollama_embeddings_locales">4.7. 2.7 ChromaDB con Ollama (Embeddings Locales)</h3>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-python hljs" data-lang="python">from langchain_chroma import Chroma
from langchain_ollama import OllamaEmbeddings
from langchain_core.documents import Document

# Configurar embeddings con Ollama
embeddings = OllamaEmbeddings(
    model="nomic-embed-text",  # Modelo de embeddings
    base_url="http://localhost:11434"  # Ollama server
)

# Crear vector store persistente
vectorstore = Chroma(
    collection_name="documentos_ollama",
    embedding_function=embeddings,
    persist_directory="./chroma_ollama_db"
)

# Agregar documentos
docs = [
    Document(
        page_content="ChromaDB es una base de datos vectorial",
        metadata={"source": "manual", "page": 1}
    ),
    Document(
        page_content="Ollama permite ejecutar LLMs localmente",
        metadata={"source": "tutorial", "page": 5}
    ),
    Document(
        page_content="LangChain facilita la creación de aplicaciones con LLMs",
        metadata={"source": "docs", "page": 10}
    )
]

vectorstore.add_documents(docs)

# Búsqueda semántica
query = "¿Qué es una base de datos de vectores?"
results = vectorstore.similarity_search(query, k=2)

for doc in results:
    print(f"Contenido: {doc.page_content}")
    print(f"Metadata: {doc.metadata}\n")

# Búsqueda con scores
results_with_scores = vectorstore.similarity_search_with_score(query, k=3)

for doc, score in results_with_scores:
    print(f"Score: {score:.4f}")
    print(f"Contenido: {doc.page_content}\n")

# Búsqueda con relevancia MMR (Maximum Marginal Relevance)
# Balancea relevancia con diversidad
results_mmr = vectorstore.max_marginal_relevance_search(
    query,
    k=3,
    fetch_k=10,  # Obtiene 10 candidatos
    lambda_mult=0.5  # 0=diversidad, 1=relevancia
)</code></pre>
</div>
</div>
</div>
<div class="sect2">
<h3 id="_2_8_sistema_rag_completo_con_chromadb">4.8. 2.8 Sistema RAG Completo con ChromaDB</h3>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-python hljs" data-lang="python">from langchain_chroma import Chroma
from langchain_ollama import OllamaEmbeddings, OllamaLLM
from langchain_community.document_loaders import PyPDFLoader, TextLoader
from langchain.text_splitter import RecursiveCharacterTextSplitter
from langchain.chains import RetrievalQA
from langchain.prompts import PromptTemplate

class RAGSystemChroma:
    """Sistema RAG completo usando ChromaDB y Ollama"""

    def __init__(self, persist_dir="./rag_chroma"):
        # Configurar embeddings
        self.embeddings = OllamaEmbeddings(model="nomic-embed-text")

        # Configurar LLM
        self.llm = OllamaLLM(
            model="mistral",
            temperature=0.7
        )

        # Configurar vectorstore
        self.vectorstore = Chroma(
            collection_name="rag_docs",
            embedding_function=self.embeddings,
            persist_directory=persist_dir
        )

        # Text splitter
        self.text_splitter = RecursiveCharacterTextSplitter(
            chunk_size=1000,
            chunk_overlap=200,
            length_function=len,
            separators=["\n\n", "\n", " ", ""]
        )

    def cargar_documentos(self, file_paths):
        """Carga documentos desde archivos"""
        all_docs = []

        for file_path in file_paths:
            if file_path.endswith('.pdf'):
                loader = PyPDFLoader(file_path)
            else:
                loader = TextLoader(file_path)

            docs = loader.load()
            all_docs.extend(docs)

        # Dividir en chunks
        chunks = self.text_splitter.split_documents(all_docs)

        # Agregar a vectorstore
        self.vectorstore.add_documents(chunks)

        print(f"✓ Cargados {len(chunks)} chunks de {len(file_paths)} documentos")

    def consultar(self, pregunta, k=3):
        """Realiza una consulta RAG"""
        # Buscar documentos relevantes
        docs = self.vectorstore.similarity_search(pregunta, k=k)

        # Construir contexto
        contexto = "\n\n".join([doc.page_content for doc in docs])

        # Prompt personalizado
        prompt = f"""Usa el siguiente contexto para responder la pregunta.
Si no sabes la respuesta, di "No tengo suficiente información".

Contexto:
{contexto}

Pregunta: {pregunta}

Respuesta detallada:"""

        # Generar respuesta
        respuesta = self.llm.invoke(prompt)

        return {
            "pregunta": pregunta,
            "respuesta": respuesta,
            "fuentes": [doc.metadata for doc in docs]
        }

    def consultar_con_chain(self, pregunta):
        """Usa RetrievalQA chain de LangChain"""
        # Crear retriever
        retriever = self.vectorstore.as_retriever(
            search_type="similarity",
            search_kwargs={"k": 3}
        )

        # Prompt personalizado
        template = """Usa el siguiente contexto para responder la pregunta al final.
Si no sabes la respuesta, simplemente di que no lo sabes, no inventes una respuesta.
Usa máximo tres oraciones y mantén la respuesta concisa.

{context}

Pregunta: {question}
Respuesta útil:"""

        QA_PROMPT = PromptTemplate(
            template=template,
            input_variables=["context", "question"]
        )

        # Crear chain
        qa_chain = RetrievalQA.from_chain_type(
            llm=self.llm,
            chain_type="stuff",
            retriever=retriever,
            return_source_documents=True,
            chain_type_kwargs={"prompt": QA_PROMPT}
        )

        # Ejecutar
        result = qa_chain({"query": pregunta})

        return result

# Uso del sistema
rag = RAGSystemChroma()

# Cargar documentos
# rag.cargar_documentos(["doc1.pdf", "doc2.txt", "doc3.md"])

# Consultar
# resultado = rag.consultar("¿Qué es ChromaDB?")
# print(resultado["respuesta"])</code></pre>
</div>
</div>
</div>
<div class="sect2">
<h3 id="_2_9_casos_de_uso_prácticos_con_chromadb">4.9. 2.9 Casos de Uso Prácticos con ChromaDB</h3>
<div class="sect3">
<h4 id="_búsqueda_semántica_de_código">4.9.1. Búsqueda Semántica de Código</h4>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-python hljs" data-lang="python">from langchain_chroma import Chroma
from langchain_ollama import OllamaEmbeddings
from langchain_core.documents import Document
import os
import glob

class CodeSearchEngine:
    """Motor de búsqueda semántica para código fuente"""

    def __init__(self):
        self.embeddings = OllamaEmbeddings(model="nomic-embed-text")
        self.vectorstore = Chroma(
            collection_name="code_search",
            embedding_function=self.embeddings,
            persist_directory="./code_db"
        )

    def indexar_repositorio(self, repo_path, extensions=[".py", ".js", ".java"]):
        """Indexa archivos de código de un repositorio"""
        documentos = []

        for ext in extensions:
            files = glob.glob(f"{repo_path}/**/*{ext}", recursive=True)

            for file_path in files:
                try:
                    with open(file_path, 'r', encoding='utf-8') as f:
                        contenido = f.read()

                    # Crear documento con metadata
                    doc = Document(
                        page_content=contenido,
                        metadata={
                            "file": file_path,
                            "extension": ext,
                            "size": len(contenido)
                        }
                    )
                    documentos.append(doc)
                except Exception as e:
                    print(f"Error leyendo {file_path}: {e}")

        # Agregar a vectorstore
        if documentos:
            self.vectorstore.add_documents(documentos)
            print(f"✓ Indexados {len(documentos)} archivos")

    def buscar_codigo(self, query, k=5):
        """Busca código relevante por descripción natural"""
        results = self.vectorstore.similarity_search_with_score(query, k=k)

        for doc, score in results:
            print(f"\n{'='*60}")
            print(f"Archivo: {doc.metadata['file']}")
            print(f"Score: {score:.4f}")
            print(f"Código:\n{doc.page_content[:300]}...")

# Uso
# code_search = CodeSearchEngine()
# code_search.indexar_repositorio("./mi_proyecto")
# code_search.buscar_codigo("función que valida emails")</code></pre>
</div>
</div>
</div>
<div class="sect3">
<h4 id="_sistema_de_recomendación_de_contenido">4.9.2. Sistema de Recomendación de Contenido</h4>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-python hljs" data-lang="python">class ContentRecommender:
    """Sistema de recomendación basado en similitud vectorial"""

    def __init__(self):
        self.embeddings = OllamaEmbeddings(model="nomic-embed-text")
        self.vectorstore = Chroma(
            collection_name="content_recommendations",
            embedding_function=self.embeddings,
            persist_directory="./recommendations_db"
        )

    def agregar_contenido(self, items):
        """
        items: lista de dict con 'id', 'title', 'description', 'category'
        """
        documents = []

        for item in items:
            # Combinar título y descripción para mejor embedding
            content = f"{item['title']}. {item['description']}"

            doc = Document(
                page_content=content,
                metadata={
                    "item_id": item['id'],
                    "title": item['title'],
                    "category": item.get('category', 'general')
                }
            )
            documents.append(doc)

        self.vectorstore.add_documents(documents)

    def recomendar_similares(self, item_id, k=5):
        """Encuentra items similares al dado"""
        # Obtener el item original
        original = self.vectorstore.get(
            where={"item_id": item_id},
            include=["documents", "metadatas"]
        )

        if not original['documents']:
            return []

        # Buscar similares
        results = self.vectorstore.similarity_search(
            original['documents'][0],
            k=k+1  # +1 porque incluye el original
        )

        # Filtrar el original
        recommendations = [
            r for r in results
            if r.metadata['item_id'] != item_id
        ][:k]

        return recommendations

    def recomendar_por_descripcion(self, description, category=None, k=5):
        """Recomienda basado en descripción de preferencias"""
        where_filter = {"category": category} if category else None

        results = self.vectorstore.similarity_search(
            description,
            k=k,
            filter=where_filter
        )

        return results

# Ejemplo de uso
# recommender = ContentRecommender()
#
# items = [
#     {
#         "id": "1",
#         "title": "Introducción a Python",
#         "description": "Aprende los fundamentos de programación en Python",
#         "category": "programming"
#     },
#     {
#         "id": "2",
#         "title": "Machine Learning con Python",
#         "description": "Curso avanzado de ML usando scikit-learn y TensorFlow",
#         "category": "ai"
#     }
# ]
#
# recommender.agregar_contenido(items)
# recomendaciones = recommender.recomendar_por_descripcion(
#     "quiero aprender inteligencia artificial"
# )</code></pre>
</div>
</div>
</div>
<div class="sect3">
<h4 id="_detección_de_duplicados_y_plagio">4.9.3. Detección de Duplicados y Plagio</h4>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-python hljs" data-lang="python">class DuplicateDetector:
    """Detector de contenido duplicado o similar"""

    def __init__(self, similarity_threshold=0.85):
        self.embeddings = OllamaEmbeddings(model="nomic-embed-text")
        self.vectorstore = Chroma(
            collection_name="duplicate_detection",
            embedding_function=self.embeddings,
            persist_directory="./duplicates_db"
        )
        self.threshold = similarity_threshold

    def agregar_documento(self, doc_id, contenido, metadata=None):
        """Agrega un documento y verifica duplicados"""
        # Buscar similares existentes
        similares = self.vectorstore.similarity_search_with_score(
            contenido,
            k=5
        )

        duplicados = []
        for doc, score in similares:
            # Score más bajo = más similar en ChromaDB con L2
            # Ajustar según función de distancia
            if score &lt; (1 - self.threshold):
                duplicados.append({
                    "doc_id": doc.metadata.get("doc_id"),
                    "similarity": 1 - score,
                    "content": doc.page_content[:100]
                })

        # Agregar documento nuevo
        self.vectorstore.add_documents([
            Document(
                page_content=contenido,
                metadata={"doc_id": doc_id, **(metadata or {})}
            )
        ])

        return {
            "agregado": doc_id,
            "duplicados_encontrados": len(duplicados),
            "duplicados": duplicados
        }

    def encontrar_fragmentos_similares(self, texto, min_length=100):
        """Encuentra fragmentos de texto similar en la base"""
        # Dividir texto en fragmentos
        fragmentos = [
            texto[i:i+min_length]
            for i in range(0, len(texto), min_length//2)
            if len(texto[i:i+min_length]) &gt;= min_length
        ]

        resultados = []
        for i, fragmento in enumerate(fragmentos):
            matches = self.vectorstore.similarity_search_with_score(
                fragmento,
                k=3
            )

            for doc, score in matches:
                if score &lt; (1 - self.threshold):
                    resultados.append({
                        "fragmento_num": i,
                        "fragmento": fragmento[:50] + "...",
                        "match": doc.page_content[:50] + "...",
                        "similarity": 1 - score,
                        "source": doc.metadata
                    })

        return resultados

# Uso
# detector = DuplicateDetector(similarity_threshold=0.90)
# resultado = detector.agregar_documento(
#     "doc123",
#     "Este es el contenido del documento..."
# )
# if resultado["duplicados_encontrados"] &gt; 0:
#     print("¡Advertencia! Posibles duplicados encontrados")</code></pre>
</div>
</div>
</div>
</div>
<div class="sect2">
<h3 id="_2_10_performance_y_optimización_en_chromadb">4.10. 2.10 Performance y Optimización en ChromaDB</h3>
<div class="sect3">
<h4 id="_configuración_de_hnsw_index">4.10.1. Configuración de HNSW Index</h4>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-python hljs" data-lang="python"># HNSW (Hierarchical Navigable Small World) es el algoritmo de indexación

# Configuración para mayor precisión (más lento)
collection_precision = client.create_collection(
    name="high_precision",
    metadata={
        "hnsw:space": "cosine",
        "hnsw:construction_ef": 200,  # Default: 100
        "hnsw:search_ef": 100,        # Default: 10
        "hnsw:M": 48                  # Default: 16 (más conexiones)
    }
)

# Configuración para mayor velocidad (menos preciso)
collection_speed = client.create_collection(
    name="high_speed",
    metadata={
        "hnsw:space": "cosine",
        "hnsw:construction_ef": 100,
        "hnsw:search_ef": 10,
        "hnsw:M": 16
    }
)

# Balance óptimo para la mayoría de casos
collection_balanced = client.create_collection(
    name="balanced",
    metadata={
        "hnsw:space": "cosine",
        "hnsw:construction_ef": 150,
        "hnsw:search_ef": 50,
        "hnsw:M": 32
    }
)</code></pre>
</div>
</div>
</div>
<div class="sect3">
<h4 id="_batch_operations">4.10.2. Batch Operations</h4>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-python hljs" data-lang="python"># Inserción por lotes (mucho más eficiente)
def insert_large_dataset(collection, documents, batch_size=100):
    """Inserta documentos en lotes para mejor performance"""
    total = len(documents)

    for i in range(0, total, batch_size):
        batch = documents[i:i+batch_size]

        collection.add(
            documents=[doc['text'] for doc in batch],
            metadatas=[doc['metadata'] for doc in batch],
            ids=[doc['id'] for doc in batch]
        )

        print(f"Procesados {min(i+batch_size, total)}/{total} documentos")

# Ejemplo con 10,000 documentos
# large_dataset = [
#     {
#         "id": f"doc_{i}",
#         "text": f"Contenido del documento {i}",
#         "metadata": {"index": i}
#     }
#     for i in range(10000)
# ]
#
# insert_large_dataset(collection, large_dataset, batch_size=500)</code></pre>
</div>
</div>
</div>
<div class="sect3">
<h4 id="_monitoreo_y_estadísticas">4.10.3. Monitoreo y Estadísticas</h4>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-python hljs" data-lang="python">import time

class ChromaDBMonitor:
    """Monitorea performance de ChromaDB"""

    def __init__(self, vectorstore):
        self.vectorstore = vectorstore
        self.collection = vectorstore._collection

    def get_stats(self):
        """Obtiene estadísticas de la colección"""
        count = self.collection.count()
        metadata = self.collection.metadata

        return {
            "total_documents": count,
            "metadata": metadata,
            "name": self.collection.name
        }

    def benchmark_query(self, query, k=10, iterations=10):
        """Benchmark de consultas"""
        times = []

        for _ in range(iterations):
            start = time.time()
            results = self.vectorstore.similarity_search(query, k=k)
            end = time.time()
            times.append(end - start)

        return {
            "avg_time": sum(times) / len(times),
            "min_time": min(times),
            "max_time": max(times),
            "total_results": len(results)
        }

    def analyze_collection(self):
        """Análisis completo de la colección"""
        stats = self.get_stats()

        # Sample query para benchmark
        if stats["total_documents"] &gt; 0:
            sample = self.collection.peek(1)
            if sample['documents']:
                benchmark = self.benchmark_query(sample['documents'][0])
                stats['performance'] = benchmark

        return stats

# Uso
# monitor = ChromaDBMonitor(vectorstore)
# stats = monitor.analyze_collection()
# print(f"Documentos: {stats['total_documents']}")
# print(f"Tiempo promedio de búsqueda: {stats['performance']['avg_time']*1000:.2f}ms")</code></pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div class="sect1">
<h2 id="_módulo_3_weaviate_base_de_datos_vectorial_graphql">5. Módulo 3: Weaviate - Base de Datos Vectorial GraphQL</h2>
<div class="sectionbody">
<div class="sect2">
<h3 id="_3_1_instalación">5.1. 3.1 Instalación</h3>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-bash hljs" data-lang="bash"># Docker (recomendado)
docker run -d -p 8080:8080 semitechnologies/weaviate:latest

# O instalar localmente
pip install weaviate-client</code></pre>
</div>
</div>
</div>
<div class="sect2">
<h3 id="_3_2_configuración_básica">5.2. 3.2 Configuración Básica</h3>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-python hljs" data-lang="python">import weaviate

# Conectar
client = weaviate.Client("http://localhost:8080")

# Verificar conexión
if client.is_ready():
    print("Weaviate está listo")

# Crear esquema
schema = {
    "classes": [
        {
            "class": "Documento",
            "description": "Documentos con texto y metadata",
            "properties": [
                {
                    "name": "contenido",
                    "dataType": ["text"],
                    "description": "Contenido del documento"
                },
                {
                    "name": "fuente",
                    "dataType": ["string"],
                    "description": "Fuente del documento"
                }
            ]
        }
    ]
}

client.schema.create(schema)</code></pre>
</div>
</div>
</div>
<div class="sect2">
<h3 id="_3_3_weaviate_con_langchain">5.3. 3.3 Weaviate con LangChain</h3>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-python hljs" data-lang="python">from langchain_weaviate.vectorstores import Weaviate
from langchain_ollama import OllamaEmbeddings

embeddings = OllamaEmbeddings(model="nomic-embed-text")

# Crear vector store
weaviate_store = Weaviate(
    client=client,
    index_name="Documento",
    text_key="contenido",
    embedding=embeddings
)

# Agregar documentos
from langchain_core.documents import Document

docs = [Document(page_content="Texto 1")]
weaviate_store.add_documents(docs)

# Buscar
results = weaviate_store.similarity_search("búsqueda", k=3)

# Búsqueda con filtros GraphQL
results = weaviate_store.similarity_search(
    "búsqueda",
    k=3,
    where_filter={"path": ["fuente"], "operator": "Equal", "valueString": "doc1"}
)</code></pre>
</div>
</div>
</div>
</div>
</div>
<div class="sect1">
<h2 id="_módulo_4_qdrant_base_de_datos_vectorial_rápida">6. Módulo 4: Qdrant - Base de Datos Vectorial Rápida</h2>
<div class="sectionbody">
<div class="sect2">
<h3 id="_4_1_instalación">6.1. 4.1 Instalación</h3>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-bash hljs" data-lang="bash"># Docker
docker run -d -p 6333:6333 qdrant/qdrant

# Python
pip install qdrant-client</code></pre>
</div>
</div>
</div>
<div class="sect2">
<h3 id="_4_2_configuración_básica">6.2. 4.2 Configuración Básica</h3>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-python hljs" data-lang="python">from qdrant_client import QdrantClient
from qdrant_client.models import Distance, VectorParams

client = QdrantClient("localhost", port=6333)

# Crear colección
client.recreate_collection(
    collection_name="documentos",
    vectors_config=VectorParams(size=1536, distance=Distance.COSINE),
)

# Agregar puntos
from qdrant_client.models import PointStruct

points = [
    PointStruct(
        id=1,
        vector=[0.1, 0.2, ..., 0.9],
        payload={"texto": "Contenido", "fuente": "doc1"}
    ),
]

client.upsert(collection_name="documentos", points=points)</code></pre>
</div>
</div>
</div>
<div class="sect2">
<h3 id="_4_3_qdrant_con_langchain">6.3. 4.3 Qdrant con LangChain</h3>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-python hljs" data-lang="python">from langchain_qdrant import Qdrant
from langchain_ollama import OllamaEmbeddings

embeddings = OllamaEmbeddings(model="nomic-embed-text")

qdrant_store = Qdrant.from_documents(
    docs,
    embeddings,
    url="http://localhost:6333",
    collection_name="documentos"
)

# Búsquedas
results = qdrant_store.similarity_search("búsqueda", k=3)

# Con filtros payload
results = qdrant_store.similarity_search(
    "búsqueda",
    k=3,
    score_threshold=0.7
)</code></pre>
</div>
</div>
</div>
</div>
</div>
<div class="sect1">
<h2 id="_módulo_5_milvus_base_de_datos_vectorial_de_alto_rendimiento">7. Módulo 5: Milvus - Base de Datos Vectorial de Alto Rendimiento</h2>
<div class="sectionbody">
<div class="sect2">
<h3 id="_5_1_instalación">7.1. 5.1 Instalación</h3>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-bash hljs" data-lang="bash"># Docker compose
docker run -d --name milvus -p 19530:19530 milvusdb/milvus:latest</code></pre>
</div>
</div>
</div>
<div class="sect2">
<h3 id="_5_2_configuración_básica">7.2. 5.2 Configuración Básica</h3>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-python hljs" data-lang="python">from pymilvus import connections, Collection, FieldSchema, CollectionSchema, DataType

# Conectar
connections.connect("default", host="localhost", port=19530)

# Definir esquema
fields = [
    FieldSchema(name="id", dtype=DataType.INT64, is_primary=True),
    FieldSchema(name="embeddings", dtype=DataType.FLOAT_VECTOR, dim=1536),
    FieldSchema(name="texto", dtype=DataType.VARCHAR, max_length=65535),
]

schema = CollectionSchema(fields, "Colección de documentos")
collection = Collection("documentos", schema)

# Crear índice
collection.create_index("embeddings", {"index_type": "IVF_FLAT", "metric_type": "L2"})</code></pre>
</div>
</div>
</div>
<div class="sect2">
<h3 id="_5_3_milvus_con_langchain">7.3. 5.3 Milvus con LangChain</h3>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-python hljs" data-lang="python">from langchain_milvus import Milvus
from langchain_ollama import OllamaEmbeddings

embeddings = OllamaEmbeddings(model="nomic-embed-text")

# Crear vector store
milvus_store = Milvus(
    embedding_function=embeddings,
    connection_args={"host": "localhost", "port": 19530},
    collection_name="documentos"
)

# Operaciones CRUD
milvus_store.add_documents(docs)
results = milvus_store.similarity_search("búsqueda", k=3)

# Búsqueda con filtros
results = milvus_store.similarity_search(
    "búsqueda",
    k=3,
    expr="texto like '%palabra%'"
)</code></pre>
</div>
</div>
</div>
</div>
</div>
<div class="sect1">
<h2 id="_módulo_6_comparativa_de_bases_de_datos_vectoriales">8. Módulo 6: Comparativa de Bases de Datos Vectoriales</h2>
<div class="sectionbody">
<div class="sect2">
<h3 id="_6_1_matriz_comparativa_completa">8.1. 6.1 Matriz Comparativa Completa</h3>
<table class="tableblock frame-all grid-all stretch">
<colgroup>
<col style="width: 20%;">
<col style="width: 20%;">
<col style="width: 20%;">
<col style="width: 20%;">
<col style="width: 20%;">
</colgroup>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock">Aspecto</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">ChromaDB</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Weaviate</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Milvus</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Qdrant</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock">Instalación</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Local simple</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Docker/Cloud</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Docker</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Docker</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock">Performance</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Media</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Alta</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Muy Alta</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Muy Alta</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock">Escalabilidad</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Limitada</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Alta</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Muy Alta</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Alta</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock">API</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Python</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">GraphQL/REST</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Python</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">REST/gRPC</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock">Persistencia</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Si</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Si</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Si</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Si</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock">Metadata Filtering</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Si</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Si</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Si</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Si</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock">Costo</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Gratuito</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Gratuito/Pago</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Gratuito</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Gratuito/Pago</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock">Ideal Para</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Desarrollo local</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Producción media</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Gran escala</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Producción</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock">Memoria RAM</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">512MB+</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">2GB+</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">4GB+</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">2GB+</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock">Latencia búsqueda</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">50-100ms</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">10-50ms</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">5-20ms</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">10-30ms</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock">Máx vectores</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">1M</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">100M+</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">1B+</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">500M+</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock">Modelos embedding</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Todos</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Propios</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Propios</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Todos</p></td>
</tr>
</tbody>
</table>
</div>
<div class="sect2">
<h3 id="_6_2_análisis_detallado_por_caso_de_uso">8.2. 6.2 Análisis Detallado por Caso de Uso</h3>
<div class="sect3">
<h4 id="_chromadb_la_opción_ideal_para_desarrollo_local">8.2.1. ChromaDB: La Opción Ideal para Desarrollo Local</h4>
<div class="paragraph">
<p><strong>Ventajas:</strong>
- Instalación trivial: <code>pip install chromadb</code>
- Funciona sin servidores externos
- Excelente integración con LangChain
- API intuitiva y Python-first
- Perfecto para prototipos rápidos
- Manejo automático de embeddings</p>
</div>
<div class="paragraph">
<p><strong>Desventajas:</strong>
- Limitado a 1 millón de vectores
- Performance degrada con colecciones grandes
- No ideal para producción multinodo
- Persistencia local solamente</p>
</div>
<div class="paragraph">
<p><strong>Caso Ideal:</strong></p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-text hljs" data-lang="text">Desarrollo de RAG
Prototipos de aplicaciones IA
Búsqueda semántica en documentos pequeños
Aprendizaje y experimentación</code></pre>
</div>
</div>
</div>
<div class="sect3">
<h4 id="_weaviate_balance_de_features_y_escalabilidad">8.2.2. Weaviate: Balance de Features y Escalabilidad</h4>
<div class="paragraph">
<p><strong>Ventajas:</strong>
- API GraphQL moderna
- Excelente para búsqueda híbrida
- Escalabilidad horizontal
- Búsqueda de texto completo integrada
- Soporte para métadata avanzada
- Cloud nativo</p>
</div>
<div class="paragraph">
<p><strong>Desventajas:</strong>
- Complejidad mayor que ChromaDB
- Requiere manejo de clusters
- Curva de aprendizaje más pronunciada
- Consumo de recursos importante</p>
</div>
<div class="paragraph">
<p><strong>Caso Ideal:</strong></p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-text hljs" data-lang="text">Sistemas de recomendación medianos
Búsqueda multimodal (texto + imagen)
Producción con crecimiento moderado
Análisis facetado complejo</code></pre>
</div>
</div>
</div>
<div class="sect3">
<h4 id="_milvus_el_gigante_de_escalabilidad">8.2.3. Milvus: El Gigante de Escalabilidad</h4>
<div class="paragraph">
<p><strong>Ventajas:</strong>
- Maneja 1 billón de vectores
- Performance extrema
- Arquitectura completamente distribuida
- Múltiples tipos de índices (HNSW, IVF, Annoy)
- Soporte para vector sparse
- Clustering automático</p>
</div>
<div class="paragraph">
<p><strong>Desventajas:</strong>
- Complejidad operacional significativa
- Requiere conocimiento de infraestructura
- Overhead importante para datasets pequeños
- Licencia compleja en algunas versiones</p>
</div>
<div class="paragraph">
<p><strong>Caso Ideal:</strong></p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-text hljs" data-lang="text">Búsqueda a escala de billones (e-commerce, redes sociales)
Aplicaciones de visión por computadora
Big data de embeddings
Sistemas de IA en producción crítica</code></pre>
</div>
</div>
</div>
<div class="sect3">
<h4 id="_qdrant_el_balance_perfecto_para_producción">8.2.4. Qdrant: El Balance Perfecto para Producción</h4>
<div class="paragraph">
<p><strong>Ventajas:</strong>
- Performance cercana a Milvus
- Operación más sencilla que Milvus
- API REST y gRPC
- Filtrado avanzado por payload
- Puntuación de características
- Excelente documentación</p>
</div>
<div class="paragraph">
<p><strong>Desventajas:</strong>
- Comunidad más pequeña
- Menos ejemplos que otros
- Curva de aprendizaje moderada</p>
</div>
<div class="paragraph">
<p><strong>Caso Ideal:</strong></p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-text hljs" data-lang="text">Producción de mediano a gran volumen
Sistemas de recomendación avanzados
Búsqueda con filtrado complejo
Balance entre features y complejidad</code></pre>
</div>
</div>
</div>
</div>
<div class="sect2">
<h3 id="_6_3_decisión_cuál_elegir">8.3. 6.3 Decisión: ¿Cuál Elegir?</h3>
<div class="sect3">
<h4 id="_árbol_de_decisión">8.3.1. Árbol de Decisión</h4>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-text hljs" data-lang="text">¿Es desarrollo/prototipado?
├─ SÍ: ChromaDB (go!)
└─ NO: ¿Cuántos vectores?
   ├─ &lt; 10 millones: Qdrant
   ├─ 10M - 100M: Weaviate
   └─ &gt; 100M: Milvus</code></pre>
</div>
</div>
</div>
<div class="sect3">
<h4 id="_matriz_de_decisión_por_equipo">8.3.2. Matriz de Decisión por Equipo</h4>
<table class="tableblock frame-all grid-all stretch">
<colgroup>
<col style="width: 20%;">
<col style="width: 20%;">
<col style="width: 20%;">
<col style="width: 20%;">
<col style="width: 20%;">
</colgroup>
<thead>
<tr>
<th class="tableblock halign-left valign-top">Tamaño</th>
<th class="tableblock halign-left valign-top">Experiencia</th>
<th class="tableblock halign-left valign-top">Volumen</th>
<th class="tableblock halign-left valign-top">Elección</th>
<th class="tableblock halign-left valign-top">Por qué</th>
</tr>
</thead>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock">Startup</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Inicial</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">&lt; 100K</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">ChromaDB</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Rápido, gratuito, sin ops</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock">Startup</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Media</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">100K-10M</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Qdrant</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Crecimiento controlado</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock">Empresa Media</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Alta</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">10M-100M</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Weaviate</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Features avanzados</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock">Empresa Grande</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Experta</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">&gt; 100M</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Milvus</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Escalabilidad extrema</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock">Academia</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Variable</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Variable</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">ChromaDB</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Aprendizaje</p></td>
</tr>
</tbody>
</table>
</div>
</div>
<div class="sect2">
<h3 id="_6_4_benchmarks_reales_con_ollama">8.4. 6.4 Benchmarks Reales (con Ollama)</h3>
<div class="paragraph">
<p><strong>Setup:</strong> Embeddings con <code>nomic-embed-text</code>, 1000 vectores de 384 dimensiones</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-text hljs" data-lang="text">ChromaDB:
- Tiempo inserción: ~500ms
- Tiempo búsqueda (k=10): ~20ms
- Memoria: ~150MB
- Recomendación: Excelente

Qdrant (Docker):
- Tiempo inserción: ~300ms
- Tiempo búsqueda (k=10): ~15ms
- Memoria: ~300MB
- Recomendación: Muy bien

Weaviate (Docker):
- Tiempo inserción: ~400ms
- Tiempo búsqueda (k=10): ~25ms
- Memoria: ~500MB
- Recomendación: Bien</code></pre>
</div>
</div>
</div>
<div class="sect2">
<h3 id="_6_5_estrategia_híbrida_múltiples_bases_de_datos">8.5. 6.5 Estrategia Híbrida: Múltiples Bases de Datos</h3>
<div class="paragraph">
<p>En sistemas complejos, usar varias BDD vectoriales:</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-python hljs" data-lang="python">class HybridVectorDB:
    """
    Estrategia:
    - ChromaDB: Cache de búsquedas frecuentes
    - Qdrant: Búsquedas principales (producción)
    - Redis: Cache en memoria para latencia ultra-baja
    """
    def __init__(self):
        self.cache = ChromaDB()  # Búsquedas recientes
        self.principal = QdrantDB()  # Fuente de verdad

    def buscar(self, query):
        # 1. Intentar caché
        try:
            return self.cache.search(query)
        except:
            # 2. Caer a BD principal
            resultados = self.principal.search(query)
            # 3. Cachear para futuro
            self.cache.add(resultados)
            return resultados</code></pre>
</div>
</div>
</div>
<div class="sect2">
<h3 id="_6_6_migración_entre_bases_de_datos">8.6. 6.6 Migración Entre Bases de Datos</h3>
<div class="sect3">
<h4 id="_chromadb_qdrant">8.6.1. ChromaDB → Qdrant</h4>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-python hljs" data-lang="python">from chromadb import Client
from qdrant_client import QdrantClient
from qdrant_client.models import PointStruct

# Extraer de ChromaDB
chroma = Client()
coleccion = chroma.get_collection("datos")
todos = coleccion.get()

# Cargar en Qdrant
qdrant = QdrantClient("localhost", port=6333)
puntos = [
    PointStruct(
        id=int(id_),
        vector=vector,
        payload={"texto": doc}
    )
    for id_, vector, doc in zip(
        todos["ids"],
        todos["embeddings"],
        todos["documents"]
    )
]
qdrant.upsert(collection_name="datos", points=puntos)</code></pre>
</div>
</div>
</div>
<div class="sect3">
<h4 id="_weaviate_milvus">8.6.2. Weaviate → Milvus</h4>
<div class="paragraph">
<p>Procesos similares mediante APIs de exportación/importación.</p>
</div>
</div>
</div>
<div class="sect2">
<h3 id="_6_7_recomendaciones_finales">8.7. 6.7 Recomendaciones Finales</h3>
<div class="paragraph">
<p><strong>Principios de Selección:</strong></p>
</div>
<div class="olist arabic">
<ol class="arabic">
<li>
<p><strong>Comienza con ChromaDB</strong></p>
<div class="ulist">
<ul>
<li>
<p>Prototipa rápido</p>
</li>
<li>
<p>Sin infraestructura</p>
</li>
<li>
<p>Sin costo operacional</p>
</li>
</ul>
</div>
</li>
<li>
<p><strong>Migra a Qdrant cuando:</strong></p>
<div class="ulist">
<ul>
<li>
<p>Superes 1 millón de vectores</p>
</li>
<li>
<p>Necesites producción real</p>
</li>
<li>
<p>Requieras filtrado avanzado</p>
</li>
</ul>
</div>
</li>
<li>
<p><strong>Considera Milvus cuando:</strong></p>
<div class="ulist">
<ul>
<li>
<p>Searhing 100+ millones vectores</p>
</li>
<li>
<p>Eres una empresa grande</p>
</li>
<li>
<p>Tienes equipo DevOps dedicado</p>
</li>
</ul>
</div>
</li>
<li>
<p><strong>Weaviate es raramente la mejor opción</strong></p>
<div class="ulist">
<ul>
<li>
<p>Ni tan simple como Qdrant</p>
</li>
<li>
<p>Ni tan potente como Milvus</p>
</li>
<li>
<p>Pero excelente en búsqueda multimodal</p>
</li>
</ul>
</div>
</li>
</ol>
</div>
</div>
</div>
</div>
<div class="sect1">
<h2 id="_parte_ii_bases_de_datos_de_grafos">9. PARTE II: BASES DE DATOS DE GRAFOS</h2>
<div class="sectionbody">

</div>
</div>
<div class="sect1">
<h2 id="_módulo_7_fundamentos_de_bases_de_datos_de_grafos">10. Módulo 7: Fundamentos de Bases de Datos de Grafos</h2>
<div class="sectionbody">
<div class="sect2">
<h3 id="_7_1_conceptos_básicos_una_nueva_forma_de_pensar">10.1. 7.1 Conceptos Básicos: Una Nueva Forma de Pensar</h3>
<div class="paragraph">
<p><strong>¿Qué es un Grafo?</strong></p>
</div>
<div class="paragraph">
<p>Un grafo es una estructura de datos que modela relaciones:
- <strong>Nodos:</strong> Entidades (personas, lugares, conceptos)
- <strong>Relaciones:</strong> Conexiones con tipo y propiedades
- <strong>Propiedades:</strong> Atributos en nodos y relaciones</p>
</div>
<div class="paragraph">
<p><strong>Ejemplo Intuitivo:</strong></p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-text hljs" data-lang="text">Redes Sociales:
(Juan:Persona)--[AMIGO_DE]--&gt;(María:Persona)
    ↓
(Trabaja_en)
    ↓
(Google:Empresa)

JSON equivalente sería ineficiente:
{usuario: "Juan", amigos: ["María", ...], trabajo: {...}}</code></pre>
</div>
</div>
<div class="paragraph">
<p><strong>¿Por qué Grafos y no Tablas?</strong></p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-sql hljs" data-lang="sql">SQL para "amigos de amigos":
SELECT DISTINCT f.nombre
FROM usuarios u
JOIN amistades a1 ON u.id = a1.usuario1
JOIN usuarios f ON a1.usuario2 = f.id
JOIN amistades a2 ON f.id = a2.usuario1
JOIN usuarios f2 ON a2.usuario2 = f2.id
WHERE u.nombre = 'Juan'
AND f2.id != u.id</code></pre>
</div>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">Cypher (Neo4j) - Mucho más claro:
MATCH (juan:Persona {nombre: "Juan"})-[:AMIGO_DE*2]-(amigo_amigo)
RETURN amigo_amigo</code></pre>
</div>
</div>
</div>
<div class="sect2">
<h3 id="_7_2_tipos_de_grafos_explicados">10.2. 7.2 Tipos de Grafos Explicados</h3>
<div class="sect3">
<h4 id="_grafo_dirigido">10.2.1. Grafo Dirigido</h4>
<div class="paragraph">
<p>Las relaciones tienen dirección explícita:</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-text hljs" data-lang="text">(Juan:Persona)-[:SIGUE]-&gt;(Tech:Canal)
(Tech:Canal)-[:PUBLICA]-&gt;(Post:Contenido)

Juan SIGUE a Tech
Tech PUBLICA Posts
Post es VISTO_POR Juan (relación inversa)</code></pre>
</div>
</div>
<div class="paragraph">
<p><strong>Uso:</strong> Twitter, YouTube, flujos de procesos</p>
</div>
</div>
<div class="sect3">
<h4 id="_grafo_no_dirigido">10.2.2. Grafo No Dirigido</h4>
<div class="paragraph">
<p>Las relaciones son bidireccionales:</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-text hljs" data-lang="text">(Juan)-[:AMIGO_DE]-(María)
Equivalente a:
(Juan)-[:AMIGO_DE]-&gt;(María)
(María)-[:AMIGO_DE]-&gt;(Juan)</code></pre>
</div>
</div>
<div class="paragraph">
<p><strong>Uso:</strong> Redes familiares, colaboraciones</p>
</div>
</div>
<div class="sect3">
<h4 id="_grafo_ponderado">10.2.3. Grafo Ponderado</h4>
<div class="paragraph">
<p>Las relaciones tienen peso/costo:</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-text hljs" data-lang="text">(Nueva_York)-[:DISTANCIA {km: 475}]-&gt;(Boston)
(Nueva_York)-[:DISTANCIA {km: 435}]-&gt;(Filadelfia)

Usado para:
- Cálculo de ruta más corta (Dijkstra)
- Optimización de viajes
- Recomendación por afinidad</code></pre>
</div>
</div>
</div>
<div class="sect3">
<h4 id="_grafo_heterogéneo">10.2.4. Grafo Heterogéneo</h4>
<div class="paragraph">
<p>Múltiples tipos de nodos y relaciones:</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-text hljs" data-lang="text">(Juan:Persona {edad: 30})
  -[:TRABAJA_EN]-&gt;(Google:Empresa)
  -[:DESARROLLA]-&gt;(Producto:Software)
  -[:COMPRADO_POR]-&gt;(Cliente:Persona)</code></pre>
</div>
</div>
</div>
</div>
<div class="sect2">
<h3 id="_7_3_conceptos_avanzados">10.3. 7.3 Conceptos Avanzados</h3>
<div class="sect3">
<h4 id="_caminos_y_recorridos">10.3.1. Caminos y Recorridos</h4>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-text hljs" data-lang="text">Camino simple: secuencia sin nodos repetidos
Juan → María → Carlos → Diana

Ciclo: camino que regresa al inicio
Juan → María → Carlos → Juan

Profundidad: número de saltos
- Juan es amigo de María (profundidad 1)
- Amigo de amigo (profundidad 2)</code></pre>
</div>
</div>
</div>
<div class="sect3">
<h4 id="_centralidad_en_grafos">10.3.2. Centralidad en Grafos</h4>
<div class="paragraph">
<p>Mide la importancia de un nodo:</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-text hljs" data-lang="text">Centralidad de Grado:
- ¿Cuántas conexiones direc tiene?
- Juan: 5 amigos (centralidad = 5)

Betweenness:
- ¿Cuántos caminos más cortos pasan por este nodo?
- Juan conecta 2 grupos aparentemente separados

Closeness:
- ¿Qué tan cerca está de todos?
- Juan conoce a personas muy conectadas</code></pre>
</div>
</div>
</div>
<div class="sect3">
<h4 id="_detección_de_comunidades">10.3.3. Detección de Comunidades</h4>
<div class="paragraph">
<p>Agrupar nodos relacionados:</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-text hljs" data-lang="text">Comunidad 1: {Juan, María, Carlos} - todos amigos
Comunidad 2: {Diana, Eva, Fernando} - otro grupo
Puente: {Gisele} - conecta ambas comunidades</code></pre>
</div>
</div>
</div>
</div>
<div class="sect2">
<h3 id="_7_4_ventajas_de_grafos_vs_otras_estructuras">10.4. 7.4 Ventajas de Grafos vs Otras Estructuras</h3>
<table class="tableblock frame-all grid-all stretch">
<colgroup>
<col style="width: 20%;">
<col style="width: 20%;">
<col style="width: 20%;">
<col style="width: 20%;">
<col style="width: 20%;">
</colgroup>
<thead>
<tr>
<th class="tableblock halign-left valign-top">Aspecto</th>
<th class="tableblock halign-left valign-top">SQL</th>
<th class="tableblock halign-left valign-top">DocumentDB</th>
<th class="tableblock halign-left valign-top">Grafo</th>
<th class="tableblock halign-left valign-top">Vectorial</th>
</tr>
</thead>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock">Relaciones</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Joins (lento)</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Anidamiento</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Nativas (rápido)</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">No</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock">Profundidad</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">O(n) joins</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Difícil</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">O(relaciones)</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">No</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock">Flexibilidad</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Esquema rígido</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Semi-flexible</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Muy flexible</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">No</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock">Patterns complejos</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Muy complejo</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Complejo</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Natural</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">No</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock">Similitud semántica</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">No</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">No</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">No</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Sí (es el punto!)</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock">Casos pocos frecuentes</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Raros</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Raros</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Excelente</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">No</p></td>
</tr>
</tbody>
</table>
</div>
<div class="sect2">
<h3 id="_7_5_casos_de_uso_prácticos">10.5. 7.5 Casos de Uso Prácticos</h3>
<div class="sect3">
<h4 id="_red_social_facebook_linkedin">10.5.1. Red Social (Facebook, LinkedIn)</h4>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-text hljs" data-lang="text">Nodos: Personas, Empresas, Eventos
Relaciones:
- AMIGO_DE: conexión bidireccional
- TRABAJA_EN: persona → empresa
- ASISTE_A: persona → evento
- SIGUE: usuario → página

Queries:
- "Amigos en común"
- "Gente que cambió de empresa"
- "Amigos que asistieron a este evento"</code></pre>
</div>
</div>
</div>
<div class="sect3">
<h4 id="_sistema_de_recomendación">10.5.2. Sistema de Recomendación</h4>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-text hljs" data-lang="text">Nodos: Usuarios, Productos, Categorías, Marcas
Relaciones:
- COMPRO: usuario → producto (peso: rating)
- PERTENECE: producto → categoría
- FABRICA: marca → producto

Queries:
- "Usuarios similares compraron..."
- "Gente que compró esto también compró..."
- "Categorías populares en tu región"</code></pre>
</div>
</div>
</div>
<div class="sect3">
<h4 id="_base_de_conocimiento">10.5.3. Base de Conocimiento</h4>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-text hljs" data-lang="text">Nodos: Conceptos, Personas, Lugares, Fechas
Relaciones:
- DESCUBIERTO_POR
- INFLUENCIO_EN
- OCURRIDO_EN
- ANTERIOR_A

Queries:
- "¿Quién inventó esto?"
- "¿Qué pasó antes?"
- "¿Cuál es la relación entre X e Y?"</code></pre>
</div>
</div>
</div>
<div class="sect3">
<h4 id="_detección_de_fraude">10.5.4. Detección de Fraude</h4>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-text hljs" data-lang="text">Nodos: Usuarios, Transacciones, Direcciones, Tarjetas
Relaciones:
- EJECUTO: usuario → transacción
- USA: usuario → tarjeta
- EN: transacción → ubicación
- MISMO: ubicación ← usuario

Pattern malicioso:
Usuario A → Ubicación A
Usuario B → Ubicación A
Usuario C → Ubicación A
(Múltiples usuarios en misma ubicación = fraude?)</code></pre>
</div>
</div>
</div>
<div class="sect3">
<h4 id="_gestión_de_dependencias">10.5.5. Gestión de Dependencias</h4>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-text hljs" data-lang="text">Nodos: Módulos, Librerías, Funciones
Relaciones:
- IMPORTA
- USA
- DEPENDE_DE

Queries:
- "¿Qué pasa si actualizo esta librería?"
- "¿Cuál es el impacto mínimo de este cambio?"
- "¿Hay ciclos de dependencia?"</code></pre>
</div>
</div>
</div>
</div>
<div class="sect2">
<h3 id="_7_6_grafos_vs_vectores_cuándo_usar_cada_uno">10.6. 7.6 Grafos vs Vectores: ¿Cuándo Usar Cada Uno?</h3>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-text hljs" data-lang="text">VECTORES:
✓ "¿Qué es parecido a esto?"
✓ Búsqueda semántica
✓ Recomendación por similitud
✓ Clustering automático

GRAFOS:
✓ "¿Cuál es la relación entre estos?"
✓ Análisis de redes
✓ Recomendación por conexión
✓ Preguntas "por qué"

MEJOR JUNTOS:
✓ "Encontrar documentos similares de los mismos autores"
✓ "Recomendaciones semánticas de gente conectada"
✓ "Búsqueda multidimensional: contenido + red"</code></pre>
</div>
</div>
</div>
</div>
</div>
<div class="sect1">
<h2 id="_módulo_8_neo4j_base_de_datos_de_grafos_líder">11. Módulo 8: Neo4j - Base de Datos de Grafos Líder</h2>
<div class="sectionbody">
<div class="paragraph">
<p><strong>Neo4j</strong> es la base de datos de grafos más popular y robusta del mundo. Su lema es "Connections First" - priorizar las relaciones sobre los datos individuales, lo que revoluciona cómo pensamos sobre el almacenamiento de datos.</p>
</div>
<div class="paragraph">
<p><strong>¿Por qué Neo4j?</strong></p>
</div>
<div class="ulist">
<ul>
<li>
<p><strong>Modelo nativo de grafos</strong>: Diseñado desde cero para relaciones</p>
</li>
<li>
<p><strong>Lenguaje Cypher</strong>: Declarativo, intuitivo y potente</p>
</li>
<li>
<p><strong>Performance excepcional</strong>: Consultas de relaciones en tiempo constante</p>
</li>
<li>
<p><strong>ACID completo</strong>: Transacciones como bases SQL tradicionales</p>
</li>
<li>
<p><strong>Escalabilidad</strong>: Soporta miles de millones de nodos y relaciones</p>
</li>
<li>
<p><strong>Visualización integrada</strong>: Browser interactivo para explorar grafos</p>
</li>
</ul>
</div>
<div class="paragraph">
<p><strong>Casos de uso ideales:</strong></p>
</div>
<div class="ulist">
<ul>
<li>
<p>Redes sociales y recomendaciones</p>
</li>
<li>
<p>Detección de fraude</p>
</li>
<li>
<p>Gestión de identidad y accesos (IAM)</p>
</li>
<li>
<p>Knowledge Graphs</p>
</li>
<li>
<p>Network y IT operations</p>
</li>
<li>
<p>Master Data Management</p>
</li>
</ul>
</div>
<div class="sect2">
<h3 id="_8_1_instalación">11.1. 8.1 Instalación</h3>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-bash hljs" data-lang="bash"># Docker (recomendado)
docker run --name neo4j \
  -p 7687:7687 \
  -p 7474:7474 \
  -e NEO4J_AUTH=neo4j/password \
  neo4j:latest

# Acceder a Neo4j Browser
# http://localhost:7474</code></pre>
</div>
</div>
</div>
<div class="sect2">
<h3 id="_8_2_lenguaje_cypher_básico">11.2. 8.2 Lenguaje Cypher Básico</h3>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">// Crear nodo
CREATE (p:Persona {nombre: "Juan", edad: 30})

// Crear relación
CREATE (j:Persona {nombre: "Juan"})-[:AMIGO_DE]-&gt;(m:Persona {nombre: "María"})

// Buscar
MATCH (p:Persona) WHERE p.edad &gt; 25 RETURN p

// Buscar relaciones
MATCH (p1:Persona)-[:AMIGO_DE]-&gt;(p2:Persona)
RETURN p1.nombre, p2.nombre

// Contar
MATCH (p:Persona) RETURN COUNT(p) as total_personas

// Actualizar
MATCH (p:Persona {nombre: "Juan"})
SET p.edad = 31
RETURN p

// Eliminar
MATCH (p:Persona {nombre: "Juan"})
DELETE p</code></pre>
</div>
</div>
</div>
<div class="sect2">
<h3 id="_8_3_neo4j_con_python">11.3. 8.3 Neo4j con Python</h3>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-python hljs" data-lang="python">from neo4j import GraphDatabase

# Conexión
URI = "bolt://localhost:7687"
AUTH = ("neo4j", "password")
driver = GraphDatabase.driver(URI, auth=AUTH)

# Crear sesión
def crear_persona(tx, nombre, edad):
    tx.run(
        "CREATE (p:Persona {nombre: $nombre, edad: $edad})",
        nombre=nombre,
        edad=edad
    )

with driver.session() as session:
    session.execute_write(crear_persona, "Juan", 30)

# Consultar
def obtener_personas(tx):
    result = tx.run("MATCH (p:Persona) RETURN p.nombre, p.edad")
    return [record for record in result]

with driver.session() as session:
    personas = session.execute_read(obtener_personas)
    for persona in personas:
        print(persona)

driver.close()</code></pre>
</div>
</div>
</div>
<div class="sect2">
<h3 id="_8_4_neo4j_con_langchain">11.4. 8.4 Neo4j con LangChain</h3>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-python hljs" data-lang="python">from langchain_community.graphs import Neo4jGraph
from langchain_ollama import OllamaLLM

# Conectar a Neo4j
graph = Neo4jGraph(
    url="bolt://localhost:7687",
    username="neo4j",
    password="password"
)

# Usar con LangChain
from langchain_experimental.graph_transformers import LLMGraphTransformer

llm = OllamaLLM(model="mistral")

# Extraer entidades y relaciones de texto
transformer = LLMGraphTransformer(llm=llm)

texto = "Juan es amigo de María. Ambos viven en Madrid."
graph_documents = transformer.convert_to_graph_documents([texto])

# Almacenar en Neo4j
graph.add_graph_documents(graph_documents)

# Realizar consultas
resultado = graph.query("MATCH (p:Persona) RETURN p LIMIT 5")
print(resultado)

# Query directo desde LangChain
from langchain_community.chains.graph_qa.cypher import GraphCypherQAChain

cypher_chain = GraphCypherQAChain.from_llm(
    llm=llm,
    graph=graph,
    verbose=True
)

respuesta = cypher_chain.run("¿Quiénes son los amigos de Juan?")
print(respuesta)</code></pre>
</div>
</div>
</div>
<div class="sect2">
<h3 id="_8_5_modelado_de_datos_en_grafos">11.5. 8.5 Modelado de Datos en Grafos</h3>
<div class="sect3">
<h4 id="_principios_de_modelado">11.5.1. Principios de Modelado</h4>
<div class="paragraph">
<p><strong>Del Modelo Relacional al Modelo de Grafos:</strong></p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-text hljs" data-lang="text">SQL (Relacional):
Tabla PERSONAS: id, nombre, edad
Tabla AMISTADES: persona_id, amigo_id, desde

Neo4j (Grafo):
(:Persona {nombre, edad})-[:AMIGO_DE {desde}]-&gt;(:Persona)

¡Las relaciones son entidades de primera clase!</code></pre>
</div>
</div>
</div>
<div class="sect3">
<h4 id="_ejemplo_completo_red_social">11.5.2. Ejemplo Completo: Red Social</h4>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">// Crear usuarios
CREATE (juan:Usuario {
    id: "u001",
    nombre: "Juan",
    email: "juan@example.com",
    edad: 30,
    ciudad: "Madrid"
})

CREATE (maria:Usuario {
    id: "u002",
    nombre: "María",
    email: "maria@example.com",
    edad: 28,
    ciudad: "Barcelona"
})

CREATE (carlos:Usuario {
    id: "u003",
    nombre: "Carlos",
    email: "carlos@example.com",
    edad: 32,
    ciudad: "Madrid"
})

// Crear relaciones de amistad
CREATE (juan)-[:AMIGO_DE {desde: date("2020-01-15")}]-&gt;(maria)
CREATE (juan)-[:AMIGO_DE {desde: date("2019-06-10")}]-&gt;(carlos)
CREATE (maria)-[:AMIGO_DE {desde: date("2021-03-20")}]-&gt;(carlos)

// Crear posts
CREATE (post1:Post {
    id: "p001",
    titulo: "Mi primer post",
    contenido: "Hola mundo desde Neo4j",
    fecha: datetime("2024-01-10T10:00:00")
})

CREATE (post2:Post {
    id: "p002",
    titulo: "Grafos son geniales",
    contenido: "Las bases de datos de grafos cambian todo",
    fecha: datetime("2024-01-11T15:30:00")
})

// Relaciones con posts
CREATE (juan)-[:PUBLICO]-&gt;(post1)
CREATE (maria)-[:PUBLICO]-&gt;(post2)
CREATE (carlos)-[:LE_GUSTA]-&gt;(post1)
CREATE (maria)-[:COMENTO {texto: "¡Muy bien!", fecha: datetime()}]-&gt;(post1)

// Grupos
CREATE (grupo1:Grupo {
    nombre: "Desarrolladores Python",
    descripcion: "Grupo de entusiastas de Python",
    creado: date("2023-05-01")
})

CREATE (juan)-[:MIEMBRO_DE {rol: "admin"}]-&gt;(grupo1)
CREATE (maria)-[:MIEMBRO_DE {rol: "member"}]-&gt;(grupo1)</code></pre>
</div>
</div>
</div>
</div>
<div class="sect2">
<h3 id="_8_6_patrones_de_cypher_avanzados">11.6. 8.6 Patrones de Cypher Avanzados</h3>
<div class="sect3">
<h4 id="_consultas_complejas">11.6.1. Consultas Complejas</h4>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">// 1. Amigos de amigos (no directos)
MATCH (yo:Usuario {nombre: "Juan"})-[:AMIGO_DE*2]-(amigo_amigo:Usuario)
WHERE NOT (yo)-[:AMIGO_DE]-(amigo_amigo)
  AND yo &lt;&gt; amigo_amigo
RETURN DISTINCT amigo_amigo.nombre
LIMIT 10

// 2. Camino más corto entre dos personas
MATCH path = shortestPath(
    (juan:Usuario {nombre: "Juan"})-[:AMIGO_DE*]-(diana:Usuario {nombre: "Diana"})
)
RETURN path, length(path) as distancia

// 3. Usuarios más influyentes (más amigos)
MATCH (u:Usuario)-[r:AMIGO_DE]-()
RETURN u.nombre, count(r) as num_amigos
ORDER BY num_amigos DESC
LIMIT 10

// 4. Posts más populares
MATCH (post:Post)&lt;-[:LE_GUSTA]-(usuario)
WITH post, count(usuario) as likes
MATCH (post)&lt;-[:PUBLICO]-(autor)
RETURN post.titulo, autor.nombre, likes
ORDER BY likes DESC
LIMIT 5

// 5. Recomendación de amigos
// "Personas con amigos en común pero que no son mis amigos"
MATCH (yo:Usuario {nombre: "Juan"})-[:AMIGO_DE]-(amigo)-[:AMIGO_DE]-(recomendado:Usuario)
WHERE NOT (yo)-[:AMIGO_DE]-(recomendado)
  AND yo &lt;&gt; recomendado
WITH recomendado, count(DISTINCT amigo) as amigos_comunes
WHERE amigos_comunes &gt;= 2
RETURN recomendado.nombre, amigos_comunes
ORDER BY amigos_comunes DESC
LIMIT 5

// 6. Timeline de usuario (posts de amigos)
MATCH (yo:Usuario {nombre: "Juan"})-[:AMIGO_DE]-(amigo)-[:PUBLICO]-&gt;(post:Post)
RETURN post.titulo, post.contenido, post.fecha, amigo.nombre as autor
ORDER BY post.fecha DESC
LIMIT 20

// 7. Detección de comunidades (grupos interconectados)
MATCH (u:Usuario)-[:AMIGO_DE*1..3]-(otros:Usuario)
WHERE u.ciudad = "Madrid"
WITH DISTINCT otros
MATCH (otros)-[:AMIGO_DE]-(amigos)
RETURN otros.nombre, count(amigos) as conexiones
ORDER BY conexiones DESC

// 8. Patrón de triángulos (grupos de 3 amigos mutuos)
MATCH (a:Usuario)-[:AMIGO_DE]-(b:Usuario)-[:AMIGO_DE]-(c:Usuario)-[:AMIGO_DE]-(a)
WHERE id(a) &lt; id(b) AND id(b) &lt; id(c)
RETURN a.nombre, b.nombre, c.nombre</code></pre>
</div>
</div>
</div>
<div class="sect3">
<h4 id="_agregaciones_y_análisis">11.6.2. Agregaciones y Análisis</h4>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">// Estadísticas de la red
MATCH (u:Usuario)
OPTIONAL MATCH (u)-[r:AMIGO_DE]-()
WITH u, count(r) as num_amistades
RETURN
    count(u) as total_usuarios,
    avg(num_amistades) as promedio_amigos,
    max(num_amistades) as max_amigos,
    min(num_amistades) as min_amigos

// Distribución por ciudad
MATCH (u:Usuario)
RETURN u.ciudad as ciudad, count(u) as usuarios
ORDER BY usuarios DESC

// Usuarios activos (que publicaron)
MATCH (u:Usuario)-[:PUBLICO]-&gt;(p:Post)
WHERE p.fecha &gt; datetime() - duration({days: 30})
WITH u, count(p) as posts_recientes
RETURN u.nombre, posts_recientes
ORDER BY posts_recientes DESC
LIMIT 10

// Engagement rate
MATCH (post:Post)&lt;-[:PUBLICO]-(autor)
OPTIONAL MATCH (post)&lt;-[:LE_GUSTA]-()
WITH post, autor, count(*) as likes
OPTIONAL MATCH (post)&lt;-[:COMENTO]-()
WITH post, autor, likes, count(*) as comentarios
RETURN
    post.titulo,
    autor.nombre,
    likes,
    comentarios,
    (likes + comentarios*2) as engagement_score
ORDER BY engagement_score DESC</code></pre>
</div>
</div>
</div>
</div>
<div class="sect2">
<h3 id="_8_7_casos_de_uso_completos">11.7. 8.7 Casos de Uso Completos</h3>
<div class="sect3">
<h4 id="_caso_1_sistema_de_e_commerce">11.7.1. Caso 1: Sistema de E-Commerce</h4>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-python hljs" data-lang="python">from neo4j import GraphDatabase
from datetime import datetime

class ECommerceGraph:
    """Sistema de e-commerce con Neo4j"""

    def __init__(self, uri, user, password):
        self.driver = GraphDatabase.driver(uri, auth=(user, password))

    def close(self):
        self.driver.close()

    def crear_esquema(self):
        """Crea el esquema inicial con índices"""
        with self.driver.session() as session:
            # Índices para performance
            session.run("CREATE INDEX usuario_email IF NOT EXISTS FOR (u:Usuario) ON (u.email)")
            session.run("CREATE INDEX producto_sku IF NOT EXISTS FOR (p:Producto) ON (p.sku)")
            session.run("CREATE CONSTRAINT pedido_id IF NOT EXISTS FOR (p:Pedido) REQUIRE p.id IS UNIQUE")

    def crear_catalogo(self):
        """Crea productos y categorías"""
        query = """
        // Categorías
        CREATE (electronicos:Categoria {nombre: "Electrónicos"})
        CREATE (computadoras:Categoria {nombre: "Computadoras"})
        CREATE (accesorios:Categoria {nombre: "Accesorios"})

        // Jerarquía de categorías
        CREATE (computadoras)-[:SUBCATEGORIA_DE]-&gt;(electronicos)
        CREATE (accesorios)-[:SUBCATEGORIA_DE]-&gt;(computadoras)

        // Productos
        CREATE (laptop:Producto {
            sku: "LAP001",
            nombre: "Laptop Pro 15",
            precio: 1299.99,
            stock: 25,
            descripcion: "Laptop profesional de 15 pulgadas"
        })

        CREATE (mouse:Producto {
            sku: "MOU001",
            nombre: "Mouse Inalámbrico",
            precio: 29.99,
            stock: 150,
            descripcion: "Mouse ergonómico inalámbrico"
        })

        CREATE (teclado:Producto {
            sku: "TEC001",
            nombre: "Teclado Mecánico",
            precio: 89.99,
            stock: 80,
            descripcion: "Teclado mecánico RGB"
        })

        // Relaciones producto-categoría
        CREATE (laptop)-[:PERTENECE_A]-&gt;(computadoras)
        CREATE (mouse)-[:PERTENECE_A]-&gt;(accesorios)
        CREATE (teclado)-[:PERTENECE_A]-&gt;(accesorios)

        // Productos relacionados
        CREATE (laptop)-[:FRECUENTEMENTE_COMPRADO_CON]-&gt;(mouse)
        CREATE (laptop)-[:FRECUENTEMENTE_COMPRADO_CON]-&gt;(teclado)
        CREATE (mouse)-[:COMPATIBLE_CON]-&gt;(laptop)
        CREATE (teclado)-[:COMPATIBLE_CON]-&gt;(laptop)

        RETURN count(*) as elementos_creados
        """

        with self.driver.session() as session:
            result = session.run(query)
            return result.single()[0]

    def crear_usuario(self, email, nombre, direccion):
        """Crea un nuevo usuario"""
        query = """
        CREATE (u:Usuario {
            email: $email,
            nombre: $nombre,
            direccion: $direccion,
            creado: datetime()
        })
        RETURN u
        """

        with self.driver.session() as session:
            result = session.run(query, email=email, nombre=nombre, direccion=direccion)
            return result.single()["u"]

    def crear_pedido(self, email_usuario, productos_cantidades):
        """
        Crea un pedido para un usuario
        productos_cantidades: lista de (sku, cantidad)
        """
        query = """
        MATCH (u:Usuario {email: $email})

        // Crear pedido
        CREATE (pedido:Pedido {
            id: randomUUID(),
            fecha: datetime(),
            estado: "pendiente"
        })
        CREATE (u)-[:REALIZO]-&gt;(pedido)

        // Agregar productos al pedido
        WITH pedido
        UNWIND $items as item
        MATCH (p:Producto {sku: item.sku})
        CREATE (pedido)-[r:CONTIENE {cantidad: item.cantidad, precio_unitario: p.precio}]-&gt;(p)

        // Actualizar stock
        SET p.stock = p.stock - item.cantidad

        // Calcular total
        WITH pedido, sum(item.cantidad * p.precio) as total
        SET pedido.total = total

        RETURN pedido
        """

        items = [{"sku": sku, "cantidad": cant} for sku, cant in productos_cantidades]

        with self.driver.session() as session:
            result = session.run(query, email=email_usuario, items=items)
            return result.single()["pedido"]

    def recomendar_productos(self, email_usuario, limite=5):
        """Recomienda productos basados en historial y comportamiento similar"""
        query = """
        MATCH (usuario:Usuario {email: $email})-[:REALIZO]-&gt;(:Pedido)-[:CONTIENE]-&gt;(comprados:Producto)

        // Encontrar usuarios similares
        MATCH (otros:Usuario)-[:REALIZO]-&gt;(:Pedido)-[:CONTIENE]-&gt;(comprados)
        WHERE otros &lt;&gt; usuario

        // Ver qué más compraron
        MATCH (otros)-[:REALIZO]-&gt;(:Pedido)-[:CONTIENE]-&gt;(recomendados:Producto)
        WHERE NOT (usuario)-[:REALIZO]-&gt;(:Pedido)-[:CONTIENE]-&gt;(recomendados)

        // Contar frecuencia y calcular score
        WITH recomendados, count(DISTINCT otros) as usuarios_similares

        // Agregar productos frecuentemente comprados juntos
        OPTIONAL MATCH (comprados)-[:FRECUENTEMENTE_COMPRADO_CON]-&gt;(relacionados:Producto)
        WHERE NOT (usuario)-[:REALIZO]-&gt;(:Pedido)-[:CONTIENE]-&gt;(relacionados)

        WITH recomendados, usuarios_similares
        UNION
        WITH relacionados as recomendados, 1 as usuarios_similares

        RETURN DISTINCT
            recomendados.nombre,
            recomendados.sku,
            recomendados.precio,
            usuarios_similares as score
        ORDER BY score DESC
        LIMIT $limite
        """

        with self.driver.session() as session:
            result = session.run(query, email=email_usuario, limite=limite)
            return [record.data() for record in result]

    def buscar_productos_por_categoria(self, categoria_nombre):
        """Busca productos en una categoría (incluyendo subcategorías)"""
        query = """
        MATCH (cat:Categoria {nombre: $categoria})
        MATCH (p:Producto)-[:PERTENECE_A]-&gt;(subcat:Categoria)
        WHERE subcat = cat OR (subcat)-[:SUBCATEGORIA_DE*]-&gt;(cat)
        RETURN p.nombre, p.precio, p.stock, p.sku
        ORDER BY p.precio
        """

        with self.driver.session() as session:
            result = session.run(query, categoria=categoria_nombre)
            return [record.data() for record in result]

    def obtener_historial_usuario(self, email_usuario):
        """Obtiene el historial completo de pedidos de un usuario"""
        query = """
        MATCH (u:Usuario {email: $email})-[:REALIZO]-&gt;(pedido:Pedido)
        OPTIONAL MATCH (pedido)-[r:CONTIENE]-&gt;(producto:Producto)

        WITH pedido, collect({
            nombre: producto.nombre,
            cantidad: r.cantidad,
            precio: r.precio_unitario
        }) as productos

        RETURN
            pedido.id,
            pedido.fecha,
            pedido.estado,
            pedido.total,
            productos
        ORDER BY pedido.fecha DESC
        """

        with self.driver.session() as session:
            result = session.run(query, email=email_usuario)
            return [record.data() for record in result]

# Uso
# ecommerce = ECommerceGraph("bolt://localhost:7687", "neo4j", "password")
# ecommerce.crear_esquema()
# ecommerce.crear_catalogo()
# ecommerce.crear_usuario("juan@example.com", "Juan", "Calle 123")
# ecommerce.crear_pedido("juan@example.com", [("LAP001", 1), ("MOU001", 2)])
# recomendaciones = ecommerce.recomendar_productos("juan@example.com")</code></pre>
</div>
</div>
</div>
<div class="sect3">
<h4 id="_caso_2_detección_de_fraude">11.7.2. Caso 2: Detección de Fraude</h4>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-python hljs" data-lang="python">class FraudDetectionGraph:
    """Sistema de detección de fraude con Neo4j"""

    def __init__(self, uri, user, password):
        self.driver = GraphDatabase.driver(uri, auth=(user, password))

    def close(self):
        self.driver.close()

    def registrar_transaccion(self, cuenta_origen, cuenta_destino, monto, timestamp):
        """Registra una transacción entre cuentas"""
        query = """
        MERGE (origen:Cuenta {numero: $origen})
        MERGE (destino:Cuenta {numero: $destino})

        CREATE (t:Transaccion {
            id: randomUUID(),
            monto: $monto,
            timestamp: datetime($timestamp),
            estado: "pendiente"
        })

        CREATE (origen)-[:ENVIO]-&gt;(t)-[:RECIBIO]-&gt;(destino)

        // Actualizar balances
        SET origen.ultimo_movimiento = datetime($timestamp)
        SET destino.ultimo_movimiento = datetime($timestamp)

        RETURN t
        """

        with self.driver.session() as session:
            result = session.run(
                query,
                origen=cuenta_origen,
                destino=cuenta_destino,
                monto=monto,
                timestamp=timestamp
            )
            return result.single()["t"]

    def detectar_ciclos_sospechosos(self, max_saltos=5):
        """Detecta ciclos de transacciones (posible lavado de dinero)"""
        query = """
        // Encontrar ciclos de transacciones
        MATCH path = (cuenta:Cuenta)-[:ENVIO|RECIBIO*2..{max_saltos}]-(cuenta)
        WHERE length(path) &gt;= 4

        // Extraer transacciones del path
        WITH cuenta, path, [r in relationships(path) | r] as rels
        WHERE all(r in rels WHERE (r)-[:ENVIO|RECIBIO]-&gt;(:Transaccion))

        // Calcular monto total del ciclo
        UNWIND rels as rel
        MATCH (rel)-[:ENVIO|RECIBIO]-(t:Transaccion)

        WITH cuenta, path, collect(DISTINCT t) as transacciones
        WITH cuenta, path, transacciones,
             reduce(total = 0.0, t in transacciones | total + t.monto) as monto_total

        WHERE monto_total &gt; 10000  // Umbral sospechoso

        RETURN
            cuenta.numero,
            length(path) as longitud_ciclo,
            monto_total,
            size(transacciones) as num_transacciones,
            transacciones
        ORDER BY monto_total DESC
        """

        with self.driver.session() as session:
            result = session.run(query.format(max_saltos=max_saltos))
            return [record.data() for record in result]

    def detectar_transferencias_rapidas(self, ventana_minutos=60):
        """Detecta cuentas con muchas transferencias en poco tiempo"""
        query = """
        MATCH (cuenta:Cuenta)-[:ENVIO]-&gt;(t:Transaccion)
        WHERE t.timestamp &gt; datetime() - duration({minutes: $ventana})

        WITH cuenta, collect(t) as transacciones, count(t) as num_transacciones
        WHERE num_transacciones &gt;= 10  // Umbral de alerta

        RETURN
            cuenta.numero,
            num_transacciones,
            reduce(total = 0.0, t in transacciones | total + t.monto) as monto_total,
            transacciones[0..5] as muestra_transacciones
        ORDER BY num_transacciones DESC
        """

        with self.driver.session() as session:
            result = session.run(query, ventana=ventana_minutos)
            return [record.data() for record in result]

    def detectar_redes_sospechosas(self):
        """Identifica redes densamente conectadas (posible fraude organizado)"""
        query = """
        // Encontrar grupos de cuentas altamente interconectadas
        MATCH (c1:Cuenta)-[:ENVIO|RECIBIO*1..3]-(c2:Cuenta)
        WHERE id(c1) &lt; id(c2)

        WITH c1, c2, count(*) as conexiones
        WHERE conexiones &gt;= 5

        // Encontrar todas las cuentas en la red
        MATCH path = (c1)-[:ENVIO|RECIBIO*1..3]-(otros:Cuenta)
        WHERE (c1)-[:ENVIO|RECIBIO*1..3]-(c2)

        WITH c1, c2, collect(DISTINCT otros) as red
        WHERE size(red) &gt;= 5

        RETURN
            c1.numero as cuenta1,
            c2.numero as cuenta2,
            size(red) as tamano_red,
            [cuenta in red | cuenta.numero] as cuentas_en_red
        ORDER BY tamano_red DESC
        LIMIT 10
        """

        with self.driver.session() as session:
            result = session.run(query)
            return [record.data() for record in result]

    def calcular_score_riesgo(self, numero_cuenta):
        """Calcula un score de riesgo para una cuenta"""
        query = """
        MATCH (cuenta:Cuenta {numero: $numero})

        // Factor 1: Número de transacciones
        OPTIONAL MATCH (cuenta)-[:ENVIO]-&gt;(t1:Transaccion)
        WITH cuenta, count(t1) as transacciones_enviadas

        // Factor 2: Monto total movido
        OPTIONAL MATCH (cuenta)-[:ENVIO]-&gt;(t2:Transaccion)
        WITH cuenta, transacciones_enviadas, sum(t2.monto) as monto_total

        // Factor 3: Conexiones con cuentas sospechosas
        OPTIONAL MATCH (cuenta)-[:ENVIO|RECIBIO*1..2]-(sospechosa:Cuenta)
        WHERE sospechosa.flagged = true
        WITH cuenta, transacciones_enviadas, monto_total, count(DISTINCT sospechosa) as conexiones_sospechosas

        // Factor 4: Velocidad de transacciones
        OPTIONAL MATCH (cuenta)-[:ENVIO]-&gt;(t3:Transaccion)
        WHERE t3.timestamp &gt; datetime() - duration({hours: 24})
        WITH cuenta, transacciones_enviadas, monto_total, conexiones_sospechosas,
             count(t3) as transacciones_24h

        // Calcular score de riesgo (0-100)
        WITH cuenta,
             transacciones_enviadas,
             monto_total,
             conexiones_sospechosas,
             transacciones_24h,
             CASE
                 WHEN transacciones_enviadas &gt; 100 THEN 30
                 WHEN transacciones_enviadas &gt; 50 THEN 20
                 WHEN transacciones_enviadas &gt; 20 THEN 10
                 ELSE 0
             END +
             CASE
                 WHEN monto_total &gt; 1000000 THEN 30
                 WHEN monto_total &gt; 500000 THEN 20
                 WHEN monto_total &gt; 100000 THEN 10
                 ELSE 0
             END +
             (conexiones_sospechosas * 15) +
             CASE
                 WHEN transacciones_24h &gt; 50 THEN 20
                 WHEN transacciones_24h &gt; 20 THEN 10
                 ELSE 0
             END as score_riesgo

        RETURN
            cuenta.numero,
            score_riesgo,
            transacciones_enviadas,
            monto_total,
            conexiones_sospechosas,
            transacciones_24h,
            CASE
                WHEN score_riesgo &gt;= 70 THEN "ALTO"
                WHEN score_riesgo &gt;= 40 THEN "MEDIO"
                ELSE "BAJO"
            END as nivel_riesgo
        """

        with self.driver.session() as session:
            result = session.run(query, numero=numero_cuenta)
            record = result.single()
            return record.data() if record else None

# Uso
# fraud_detector = FraudDetectionGraph("bolt://localhost:7687", "neo4j", "password")
# fraud_detector.registrar_transaccion("ACC001", "ACC002", 5000, "2024-01-15T10:30:00")
# ciclos = fraud_detector.detectar_ciclos_sospechosos()
# score = fraud_detector.calcular_score_riesgo("ACC001")</code></pre>
</div>
</div>
</div>
</div>
<div class="sect2">
<h3 id="_8_8_algoritmos_de_grafos_en_neo4j">11.8. 8.8 Algoritmos de Grafos en Neo4j</h3>
<div class="sect3">
<h4 id="_graph_data_science_library_gds">11.8.1. Graph Data Science Library (GDS)</h4>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">// Instalar GDS: https://neo4j.com/docs/graph-data-science/

// 1. PageRank - Encontrar nodos más importantes
CALL gds.pageRank.stream('mi_grafo')
YIELD nodeId, score
RETURN gds.util.asNode(nodeId).nombre AS usuario, score
ORDER BY score DESC
LIMIT 10

// 2. Community Detection (Louvain) - Detectar comunidades
CALL gds.louvain.stream('mi_grafo')
YIELD nodeId, communityId
WITH gds.util.asNode(nodeId) AS usuario, communityId
RETURN communityId, collect(usuario.nombre) AS miembros, count(*) AS tamano
ORDER BY tamano DESC

// 3. Camino más corto (Dijkstra)
MATCH (origen:Usuario {nombre: "Juan"}), (destino:Usuario {nombre: "María"})
CALL gds.shortestPath.dijkstra.stream('mi_grafo', {
    sourceNode: origen,
    targetNode: destino
})
YIELD path, totalCost
RETURN path, totalCost

// 4. Similitud de nodos (Node Similarity)
CALL gds.nodeSimilarity.stream('mi_grafo')
YIELD node1, node2, similarity
WHERE similarity &gt; 0.5
RETURN
    gds.util.asNode(node1).nombre AS usuario1,
    gds.util.asNode(node2).nombre AS usuario2,
    similarity
ORDER BY similarity DESC
LIMIT 20

// 5. Centralidad de intermediación (Betweenness Centrality)
// Identifica "puentes" entre comunidades
CALL gds.betweenness.stream('mi_grafo')
YIELD nodeId, score
RETURN gds.util.asNode(nodeId).nombre AS usuario, score
ORDER BY score DESC
LIMIT 10</code></pre>
</div>
</div>
</div>
</div>
<div class="sect2">
<h3 id="_8_9_integración_avanzada_con_langchain_y_ollama">11.9. 8.9 Integración Avanzada con LangChain y Ollama</h3>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-python hljs" data-lang="python">from langchain_community.graphs import Neo4jGraph
from langchain_ollama import OllamaLLM
from langchain_experimental.graph_transformers import LLMGraphTransformer
from langchain_community.chains.graph_qa.cypher import GraphCypherQAChain
from langchain.prompts import PromptTemplate

class GraphRAGSystem:
    """Sistema RAG avanzado usando Neo4j como Knowledge Graph"""

    def __init__(self, neo4j_uri, neo4j_user, neo4j_password):
        # Configurar Neo4j
        self.graph = Neo4jGraph(
            url=neo4j_uri,
            username=neo4j_user,
            password=neo4j_password
        )

        # Configurar LLM
        self.llm = OllamaLLM(
            model="mistral",
            temperature=0.7
        )

        # Transformer para extraer grafos de texto
        self.transformer = LLMGraphTransformer(llm=self.llm)

    def construir_grafo_desde_texto(self, textos):
        """Construye un knowledge graph desde texto no estructurado"""
        all_graph_docs = []

        for texto in textos:
            # Extraer entidades y relaciones
            graph_docs = self.transformer.convert_to_graph_documents([texto])
            all_graph_docs.extend(graph_docs)

        # Almacenar en Neo4j
        self.graph.add_graph_documents(all_graph_docs)

        print(f"✓ Procesados {len(textos)} textos")
        print(f"✓ Creados {len(all_graph_docs)} documentos de grafo")

    def consultar_grafo(self, pregunta):
        """Consulta el grafo usando lenguaje natural"""
        # Prompt personalizado para generar Cypher
        cypher_template = """Genera una consulta Cypher basada en el esquema del grafo y la pregunta del usuario.

Esquema del grafo:
{schema}

Pregunta: {question}

Genera SOLO la consulta Cypher, sin explicaciones adicionales.
La consulta debe retornar información relevante para responder la pregunta.

Consulta Cypher:"""

        # Crear chain para QA sobre grafo
        chain = GraphCypherQAChain.from_llm(
            llm=self.llm,
            graph=self.graph,
            verbose=True,
            return_intermediate_steps=True
        )

        # Ejecutar consulta
        response = chain({"query": pregunta})

        return {
            "pregunta": pregunta,
            "cypher_generado": response.get("intermediate_steps", [{}])[0].get("query", ""),
            "respuesta": response["result"],
            "contexto_grafo": response.get("intermediate_steps", [])
        }

    def explorar_entidades_relacionadas(self, entidad_nombre, max_profundidad=2):
        """Explora entidades relacionadas en el grafo"""
        query = f"""
        MATCH (entidad {{nombre: $nombre}})
        CALL apoc.path.subgraphAll(entidad, {{
            maxLevel: $max_profundidad
        }})
        YIELD nodes, relationships

        UNWIND nodes AS nodo
        WITH DISTINCT nodo, relationships

        RETURN
            labels(nodo)[0] AS tipo,
            nodo.nombre AS nombre,
            properties(nodo) AS propiedades,
            [r IN relationships WHERE startNode(r) = nodo OR endNode(r) = nodo |
                type(r)] AS relaciones
        """

        result = self.graph.query(
            query,
            params={"nombre": entidad_nombre, "max_profundidad": max_profundidad}
        )

        return result

    def analizar_conexiones(self, entidad1, entidad2):
        """Analiza las conexiones entre dos entidades"""
        query = """
        MATCH (e1 {nombre: $nombre1}), (e2 {nombre: $nombre2})
        MATCH path = allShortestPaths((e1)-[*..5]-(e2))

        WITH path, relationships(path) AS rels, nodes(path) AS nodos

        RETURN
            [n IN nodos | {tipo: labels(n)[0], nombre: n.nombre}] AS camino,
            [r IN rels | type(r)] AS tipos_relaciones,
            length(path) AS distancia
        ORDER BY distancia
        LIMIT 5
        """

        result = self.graph.query(
            query,
            params={"nombre1": entidad1, "nombre2": entidad2}
        )

        return result

    def generar_resumen_grafo(self):
        """Genera un resumen estadístico del grafo"""
        query = """
        // Contar nodos por tipo
        MATCH (n)
        WITH labels(n)[0] AS tipo, count(n) AS cantidad
        WITH collect({tipo: tipo, cantidad: cantidad}) AS nodos_por_tipo

        // Contar relaciones por tipo
        MATCH ()-[r]-&gt;()
        WITH nodos_por_tipo, type(r) AS tipo_rel, count(r) AS cantidad_rel
        WITH nodos_por_tipo, collect({tipo: tipo_rel, cantidad: cantidad_rel}) AS relaciones_por_tipo

        RETURN {
            nodos: nodos_por_tipo,
            relaciones: relaciones_por_tipo
        } AS resumen
        """

        result = self.graph.query(query)
        return result[0]["resumen"] if result else {}

# Uso ejemplo
# graph_rag = GraphRAGSystem("bolt://localhost:7687", "neo4j", "password")
#
# textos = [
#     "Python fue creado por Guido van Rossum en 1991.",
#     "LangChain es un framework para desarrollar aplicaciones con LLMs.",
#     "Neo4j es la base de datos de grafos más popular del mundo."
# ]
#
# graph_rag.construir_grafo_desde_texto(textos)
# resultado = graph_rag.consultar_grafo("¿Quién creó Python?")
# print(resultado["respuesta"])</code></pre>
</div>
</div>
</div>
<div class="sect2">
<h3 id="_8_10_optimización_y_mejores_prácticas">11.10. 8.10 Optimización y Mejores Prácticas</h3>
<div class="sect3">
<h4 id="_índices_y_constraints">11.10.1. Índices y Constraints</h4>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">// Constraints (también crean índices)
CREATE CONSTRAINT usuario_email IF NOT EXISTS
FOR (u:Usuario) REQUIRE u.email IS UNIQUE

CREATE CONSTRAINT producto_sku IF NOT EXISTS
FOR (p:Producto) REQUIRE p.sku IS UNIQUE

// Índices simples
CREATE INDEX usuario_nombre IF NOT EXISTS
FOR (u:Usuario) ON (u.nombre)

CREATE INDEX post_fecha IF NOT EXISTS
FOR (p:Post) ON (p.fecha)

// Índices compuestos
CREATE INDEX usuario_ciudad_edad IF NOT EXISTS
FOR (u:Usuario) ON (u.ciudad, u.edad)

// Full-text search index
CREATE FULLTEXT INDEX post_contenido IF NOT EXISTS
FOR (p:Post) ON EACH [p.titulo, p.contenido]

// Usar full-text index
CALL db.index.fulltext.queryNodes("post_contenido", "grafos bases datos")
YIELD node, score
RETURN node.titulo, score
ORDER BY score DESC

// Ver índices existentes
SHOW INDEXES

// Ver constraints
SHOW CONSTRAINTS</code></pre>
</div>
</div>
</div>
<div class="sect3">
<h4 id="_optimización_de_queries">11.10.2. Optimización de Queries</h4>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-cypher hljs" data-lang="cypher">// ❌ MAL: Scan completo de nodos
MATCH (u:Usuario)
WHERE u.nombre = "Juan"
RETURN u

// ✅ BIEN: Usar el índice directamente
MATCH (u:Usuario {nombre: "Juan"})
RETURN u

// ❌ MAL: Profundidad variable sin límite
MATCH (a)-[*]-(b)
RETURN a, b

// ✅ BIEN: Limitar profundidad
MATCH (a)-[*1..3]-(b)
RETURN a, b
LIMIT 100

// ❌ MAL: Múltiples OPTIONAL MATCH sin filtros
MATCH (u:Usuario)
OPTIONAL MATCH (u)-[:AMIGO_DE]-(a)
OPTIONAL MATCH (u)-[:PUBLICO]-&gt;(p)
RETURN u, collect(a), collect(p)

// ✅ BIEN: Combinar en un solo patrón cuando sea posible
MATCH (u:Usuario)
OPTIONAL MATCH (u)-[:AMIGO_DE]-(a)
WITH u, collect(a) AS amigos
OPTIONAL MATCH (u)-[:PUBLICO]-&gt;(p)
RETURN u, amigos, collect(p) AS posts

// Usar EXPLAIN y PROFILE para analizar
PROFILE
MATCH (u:Usuario {nombre: "Juan"})-[:AMIGO_DE*2]-(amigo)
RETURN DISTINCT amigo.nombre</code></pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div class="sect1">
<h2 id="_módulo_9_arangodb_base_de_datos_multi_modelo">12. Módulo 9: ArangoDB - Base de Datos Multi-Modelo</h2>
<div class="sectionbody">
<div class="sect2">
<h3 id="_9_1_características">12.1. 9.1 Características</h3>
<div class="paragraph">
<p><strong>Multi-Modelo:</strong>
- Documentos (JSON)
- Grafos
- Búsqueda (full-text)
- Key-Value</p>
</div>
</div>
<div class="sect2">
<h3 id="_9_2_instalación">12.2. 9.2 Instalación</h3>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-bash hljs" data-lang="bash">docker run -d -p 8529:8529 arangodb/arangodb:latest
# Usuario: root, sin contraseña</code></pre>
</div>
</div>
</div>
<div class="sect2">
<h3 id="_9_3_aql_arangodb_query_language">12.3. 9.3 AQL (ArangoDB Query Language)</h3>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-aql hljs" data-lang="aql">// Insertar documentos
INSERT {
  nombre: "Juan",
  edad: 30
} INTO personas

// Insertar relación
INSERT {
  _from: "personas/1",
  _to: "personas/2",
  tipo: "AMIGO_DE"
} INTO amistades

// Consultar
FOR p IN personas
  FILTER p.edad &gt; 25
  RETURN p

// Recorrido de grafo
FOR p IN personas
  FOR f IN 1..2 OUTBOUND p amistades
    RETURN {persona: p.nombre, amigo: f.nombre}</code></pre>
</div>
</div>
</div>
</div>
</div>
<div class="sect1">
<h2 id="_módulo_10_knowledge_graphs_con_langchain">13. Módulo 10: Knowledge Graphs con LangChain</h2>
<div class="sectionbody">
<div class="sect2">
<h3 id="_10_1_crear_knowledge_graph_desde_texto">13.1. 10.1 Crear Knowledge Graph desde Texto</h3>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-python hljs" data-lang="python">from langchain_community.graphs import Neo4jGraph
from langchain_experimental.graph_transformers import LLMGraphTransformer
from langchain_ollama import OllamaLLM

llm = OllamaLLM(model="mistral")

# Crear transformador
transformer = LLMGraphTransformer(llm=llm)

# Textos para procesar
textos = [
    "Python es un lenguaje de programación creado por Guido van Rossum.",
    "LangChain es un framework para aplicaciones con LLMs.",
    "Neo4j es una base de datos de grafos.",
    "LangChain se usa para conectar LLMs con datos externos."
]

# Extraer grafo
all_docs = []
for texto in textos:
    all_docs.extend(transformer.convert_to_graph_documents([texto]))

# Conectar a Neo4j
graph = Neo4jGraph(
    url="bolt://localhost:7687",
    username="neo4j",
    password="password"
)

graph.add_graph_documents(all_docs)</code></pre>
</div>
</div>
</div>
<div class="sect2">
<h3 id="_10_2_qa_sobre_grafo">13.2. 10.2 QA sobre Grafo</h3>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-python hljs" data-lang="python">from langchain_community.chains.graph_qa.cypher import GraphCypherQAChain

qa_chain = GraphCypherQAChain.from_llm(
    llm=llm,
    graph=graph,
    verbose=True
)

# Preguntas
preguntas = [
    "¿Quién creó Python?",
    "¿Qué es LangChain?",
    "¿Qué relaciones hay entre LangChain y Neo4j?",
    "¿Para qué sirve LangChain?"
]

for pregunta in preguntas:
    respuesta = qa_chain.run(pregunta)
    print(f"\n{pregunta}\n{respuesta}")</code></pre>
</div>
</div>
</div>
</div>
</div>
<div class="sect1">
<h2 id="_módulo_11_búsqueda_híbrida_vectorial_grafos">14. Módulo 11: Búsqueda Híbrida (Vectorial + Grafos)</h2>
<div class="sectionbody">
<div class="sect2">
<h3 id="_11_1_hybrid_rag">14.1. 11.1 Hybrid RAG</h3>
<div class="paragraph">
<p>Combina vectores con relaciones de grafo:</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-python hljs" data-lang="python">from langchain_chroma import Chroma
from langchain_community.graphs import Neo4jGraph
from langchain_ollama import OllamaLLM, OllamaEmbeddings

class HybridRAG:
    def __init__(self):
        self.llm = OllamaLLM(model="mistral")
        self.embeddings = OllamaEmbeddings(model="nomic-embed-text")

        # Vector store
        self.vector_store = Chroma(
            embedding_function=self.embeddings,
            persist_directory="./hybrid_db"
        )

        # Grafo
        self.graph = Neo4jGraph(
            url="bolt://localhost:7687",
            username="neo4j",
            password="password"
        )

    def buscar_hibrido(self, pregunta, k=3):
        # 1. Búsqueda vectorial
        vector_docs = self.vector_store.similarity_search(pregunta, k=k)

        # 2. Extraer entidades mencionadas
        entidades_prompt = f"""
Extrae las entidades principales de esta pregunta como lista Python.
Solo responde con la lista.

Pregunta: {pregunta}
"""
        entidades_text = self.llm.invoke(entidades_prompt)

        # 3. Búsqueda en grafo por entidades
        grafo_docs = []
        for entidad in entidades_text.split(','):
            query = f"""
            MATCH (n) WHERE n.nombre CONTAINS '{entidad.strip()}'
            OPTIONAL MATCH (n)-[r]-&gt;(m)
            RETURN n, r, m
            LIMIT 5
            """
            try:
                resultados = self.graph.query(query)
                grafo_docs.extend(resultados)
            except:
                pass

        # 4. Combinar resultados
        return {
            "vectores": vector_docs,
            "grafo": grafo_docs,
            "total": len(vector_docs) + len(grafo_docs)
        }

    def responder(self, pregunta):
        resultados = self.buscar_hibrido(pregunta)

        # Preparar contexto
        contexto = "Información de búsqueda vectorial:\n"
        for doc in resultados["vectores"]:
            contexto += f"- {doc.page_content}\n"

        contexto += "\nRelaciones encontradas en grafo:\n"
        for item in resultados["grafo"]:
            contexto += f"- {item}\n"

        # Generar respuesta
        prompt = f"""
Usa la siguiente información para responder:

{contexto}

Pregunta: {pregunta}

Respuesta:
"""

        return self.llm.invoke(prompt)

# Usar
hybrid_rag = HybridRAG()
respuesta = hybrid_rag.responder("¿Cuál es la relación entre LangChain y Python?")
print(respuesta)</code></pre>
</div>
</div>
</div>
</div>
</div>
<div class="sect1">
<h2 id="_módulo_12_casos_de_uso_avanzados">15. Módulo 12: Casos de Uso Avanzados</h2>
<div class="sectionbody">
<div class="sect2">
<h3 id="_12_1_sistema_de_recomendación">15.1. 12.1 Sistema de Recomendación</h3>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-python hljs" data-lang="python">class SystemOfRecommendation:
    def __init__(self):
        self.graph = Neo4jGraph(
            url="bolt://localhost:7687",
            username="neo4j",
            password="password"
        )

    def crear_datos(self):
        # Crear usuario, productos y ratings
        cypher = """
        CREATE (u1:Usuario {nombre: "Juan", id: "u1"})
        CREATE (u2:Usuario {nombre: "María", id: "u2"})

        CREATE (p1:Producto {nombre: "Laptop", id: "p1", categoria: "Electrónica"})
        CREATE (p2:Producto {nombre: "Mouse", id: "p2", categoria: "Accesorios"})
        CREATE (p3:Producto {nombre: "Libro Python", id: "p3", categoria: "Libros"})

        CREATE (u1)-[:COMPRO {rating: 5}]-&gt;(p1)
        CREATE (u1)-[:COMPRO {rating: 4}]-&gt;(p2)
        CREATE (u2)-[:COMPRO {rating: 5}]-&gt;(p2)
        CREATE (u2)-[:COMPRO {rating: 3}]-&gt;(p3)
        """
        self.graph.query(cypher)

    def recomendar(self, usuario_id):
        # Usuarios similares
        query = """
        MATCH (u:Usuario {id: $usuario_id})-[:COMPRO]-&gt;(p:Producto)
        &lt;-[:COMPRO]-(similares:Usuario)
        MATCH (similares)-[:COMPRO]-&gt;(recomendado:Producto)
        WHERE NOT (u)-[:COMPRO]-&gt;(recomendado)
        RETURN recomendado, COUNT(*) as frecuencia
        ORDER BY frecuencia DESC
        LIMIT 5
        """

        return self.graph.query(query, {"usuario_id": usuario_id})

recomendador = SystemOfRecommendation()
recomendador.crear_datos()
print(recomendador.recomendar("u1"))</code></pre>
</div>
</div>
</div>
<div class="sect2">
<h3 id="_12_2_detección_de_fraude">15.2. 12.2 Detección de Fraude</h3>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-python hljs" data-lang="python">class FraudDetector:
    def __init__(self, graph):
        self.graph = graph

    def crear_red_transacciones(self):
        cypher = """
        CREATE (u1:Usuario {nombre: "Usuario1", id: "u1"})
        CREATE (u2:Usuario {nombre: "Usuario2", id: "u2"})
        CREATE (u3:Usuario {nombre: "Usuario3", id: "u3"})

        CREATE (u1)-[:TRANSACCIONO {monto: 100, fecha: "2024-01-01"}]-&gt;(u2)
        CREATE (u2)-[:TRANSACCIONO {monto: 50, fecha: "2024-01-02"}]-&gt;(u3)
        CREATE (u3)-[:TRANSACCIONO {monto: 200, fecha: "2024-01-03"}]-&gt;(u1)
        """
        self.graph.query(cypher)

    def detectar_ciclos(self):
        # Detectar ciclos de transacciones (señal de fraude)
        query = """
        MATCH (u:Usuario)-[*2..5]-&gt;(u)
        RETURN u, COUNT(*) as ciclos
        """
        return self.graph.query(query)

detector = FraudDetector(graph)
detector.crear_red_transacciones()
print("Ciclos detectados:", detector.detectar_ciclos())</code></pre>
</div>
</div>
</div>
</div>
</div>
<div class="sect1">
<h2 id="_módulo_13_optimización_y_producción">16. Módulo 13: Optimización y Producción</h2>
<div class="sectionbody">
<div class="sect2">
<h3 id="_13_1_índices_en_neo4j">16.1. 13.1 Índices en Neo4j</h3>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-python hljs" data-lang="python">def crear_indices(graph):
    # Índice en propiedad
    graph.query("CREATE INDEX ON :Persona(nombre)")

    # Índice en relación
    graph.query("CREATE INDEX ON :AMIGO_DE(fecha)")

    # Índice compuesto
    graph.query("CREATE INDEX ON :Persona(nombre, edad)")

    # Ver índices
    indices = graph.query("SHOW INDEXES")
    for indice in indices:
        print(indice)

crear_indices(graph)</code></pre>
</div>
</div>
</div>
<div class="sect2">
<h3 id="_13_2_caché_de_consultas">16.2. 13.2 Caché de Consultas</h3>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-python hljs" data-lang="python">from functools import lru_cache

class GraphCache:
    def __init__(self, graph):
        self.graph = graph
        self.cache = {}

    @lru_cache(maxsize=100)
    def consulta_cached(self, query):
        return self.graph.query(query)

    def limpiar_cache(self):
        self.cache.clear()
        self.consulta_cached.cache_clear()

cache = GraphCache(graph)</code></pre>
</div>
</div>
</div>
</div>
</div>
<div class="sect1">
<h2 id="_módulo_14_proyecto_final_sistema_integral">17. Módulo 14: Proyecto Final - Sistema Integral</h2>
<div class="sectionbody">
<div class="sect2">
<h3 id="_14_1_arquitectura_del_proyecto">17.1. 14.1 Arquitectura del Proyecto</h3>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-text hljs" data-lang="text">Sistema de Búsqueda y Recomendación Inteligente:

1. Ingesta de Datos
   - Documentos → Embeddings → ChromaDB
   - Entidades → Relaciones → Neo4j

2. Indexación
   - Vector índices (HNSW)
   - Grafo índices
   - Índices híbridos

3. Consultas
   - Búsqueda vectorial
   - Recorrido de grafo
   - Búsqueda híbrida

4. Ranking
   - Por similitud vectorial
   - Por centralidad en grafo
   - Por puntuación combinada

5. Respuesta
   - Generación LLM
   - Citas y explicaciones
   - Relaciones mostradas</code></pre>
</div>
</div>
</div>
<div class="sect2">
<h3 id="_14_2_estructura_del_código">17.2. 14.2 Estructura del Código</h3>
<div class="listingblock">
<div class="content">
<pre class="highlightjs highlight"><code class="language-python hljs" data-lang="python">class SistemaIntegral:
    def __init__(self):
        # Vector DB
        self.embeddings = OllamaEmbeddings(model="nomic-embed-text")
        self.vector_store = Chroma(
            embedding_function=self.embeddings,
            persist_directory="./sistema_db"
        )

        # Graph DB
        self.graph = Neo4jGraph(
            url="bolt://localhost:7687",
            username="neo4j",
            password="password"
        )

        # LLM
        self.llm = OllamaLLM(model="mistral")

    def procesar_documento(self, doc_path):
        # 1. Cargar
        from langchain_community.document_loaders import PyPDFLoader
        loader = PyPDFLoader(doc_path)
        docs = loader.load()

        # 2. Chunks
        from langchain.text_splitter import RecursiveCharacterTextSplitter
        splitter = RecursiveCharacterTextSplitter(chunk_size=512)
        chunks = splitter.split_documents(docs)

        # 3. Vector store
        self.vector_store.add_documents(chunks)

        # 4. Extraer entidades
        from langchain_experimental.graph_transformers import LLMGraphTransformer
        transformer = LLMGraphTransformer(llm=self.llm)

        graph_docs = transformer.convert_to_graph_documents(chunks)
        self.graph.add_graph_documents(graph_docs)

    def buscar(self, consulta):
        # Búsqueda vectorial
        vectores = self.vector_store.similarity_search(consulta, k=3)

        # Búsqueda en grafo
        query = """
        MATCH (n) WHERE any(prop in keys(n)
               WHERE n[prop] CONTAINS $consulta)
        OPTIONAL MATCH (n)-[r]-&gt;(m)
        RETURN n, r, m LIMIT 5
        """

        try:
            grafo = self.graph.query(query, {"consulta": consulta})
        except:
            grafo = []

        return vectores, grafo

    def responder(self, consulta):
        vectores, grafo = self.buscar(consulta)

        contexto = "De documentos:\n"
        for doc in vectores:
            contexto += f"- {doc.page_content}\n"

        contexto += "\nDe relaciones:\n"
        for item in grafo:
            contexto += f"- {item}\n"

        prompt = f"""
Contexto:
{contexto}

Pregunta: {consulta}

Respuesta detallada en español:
"""

        return self.llm.invoke(prompt)

# Usar
sistema = SistemaIntegral()
respuesta = sistema.responder("¿Cuál es la relación entre RAG y LangChain?")
print(respuesta)</code></pre>
</div>
</div>
</div>
</div>
</div>
<div class="sect1">
<h2 id="_anexo_a_comparativa_vectorial_vs_grafo">18. Anexo A: Comparativa Vectorial vs Grafo</h2>
<div class="sectionbody">
<table class="tableblock frame-all grid-all stretch">
<colgroup>
<col style="width: 33.3333%;">
<col style="width: 33.3333%;">
<col style="width: 33.3334%;">
</colgroup>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock">Aspecto</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Vectorial</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Grafo</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock">Mejor Para</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Similitud semántica</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Relaciones explícitas</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock">Velocidad</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Muy rápida</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Media</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock">Memoria</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Media</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Variable</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock">Escalabilidad</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Horizontal</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Vertical</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock">Flexibilidad</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Esquema flexible</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Requiere estructura</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock">Recomendaciones</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Por similitud</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Por conexiones</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock">Análisis de Red</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">No</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Excelente</p></td>
</tr>
</tbody>
</table>
</div>
</div>
<div class="sect1">
<h2 id="_anexo_b_stack_recomendado">19. Anexo B: Stack Recomendado</h2>
<div class="sectionbody">
<div class="paragraph">
<p><strong>Desarrollo Local:</strong>
- ChromaDB (vectores, fácil)
- Neo4j Community (grafos, gratis)
- Ollama (LLM local)
- LangChain (orquestación)</p>
</div>
<div class="paragraph">
<p><strong>Producción:</strong>
- Weaviate o Qdrant (vectores escalables)
- Neo4j Enterprise (grafos escalables)
- Milvus (millones de vectores)
- LangChain + API framework</p>
</div>
</div>
</div>
<div class="sect1">
<h2 id="_anexo_c_recursos">20. Anexo C: Recursos</h2>
<div class="sectionbody">
<div class="ulist">
<ul>
<li>
<p>Neo4j Documentation: <a href="https://neo4j.com/developer/" class="bare">https://neo4j.com/developer/</a></p>
</li>
<li>
<p>LangChain Graphs: <a href="https://python.langchain.com/docs/use_cases/graph_qa" class="bare">https://python.langchain.com/docs/use_cases/graph_qa</a></p>
</li>
<li>
<p>ChromaDB Docs: <a href="https://docs.trychroma.com/" class="bare">https://docs.trychroma.com/</a></p>
</li>
<li>
<p>Qdrant Docs: <a href="https://qdrant.tech/documentation/" class="bare">https://qdrant.tech/documentation/</a></p>
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="footer">
<div id="footer-text">
Last updated 2025-11-16 22:42:44 +0100
</div>
</div>
<script src="https://cdnjs.cloudflare.com/ajax/libs/highlight.js/11.8.0/highlight.min.js"></script>
<script>
if (!hljs.initHighlighting.called) {
  hljs.initHighlighting.called = true
  ;[].slice.call(document.querySelectorAll('pre.highlight > code[data-lang]')).forEach(function (el) { hljs.highlightBlock(el) })
}
</script>
</body>
</html>